[
  
  {
    "title": "Floral A-Line Summer Dress",
    "description": "Embrace the sunshine in this effortlessly chic Floral A-Line Summer Dress. Crafted from a lightweight, breathable viscose blend, this dress is designed to keep you cool and comfortable all day long. The relaxed A-line silhouette flows gracefully from a fitted bodice, flattering every body type by skimming over the hips and thighs. It features a vibrant, all-over floral print, a elegant round neckline, and short, slightly puffed sleeves for a touch of feminine charm. The hidden back zipper ensures a smooth fit, while the knee-length design makes it perfect for brunches, garden parties, or a casual day out. Pair it with sandals and a sunhat for a classic summer look or dress it up with wedges and statement jewelry for an evening event. Easy to care for and machine washable, this dress is a versatile staple for your warm-weather wardrobe.",
    "price": 2200,
    "discountPrice": 1799,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Dress",
    "brand": "Westside",
    "rating": 4.6,
    "stock": 35,
    "featured": true,
    "sizes": ["S", "M", "L", "XL"],
    "images": ["https://img.drz.lazcdn.com/g/kf/Se9151728a603403f8c637235ba97d061x.jpg_720x720q80.jpg_.webp", "https://img.drz.lazcdn.com/g/kf/Sc47b9500787348e4af17503b5992b42c9.jpg_720x720q80.jpg_.webp", "https://img.drz.lazcdn.com/g/kf/Sc47b9500787348e4af17503b5992b42c9.jpg_720x720q80.jpg_.webp"],
    "reviews": [
      {"user": "Anika Rahman", "rating": 5, "comment": "The fabric is so soft and the fit is perfect! The floral pattern is even prettier in person."},
      {"user": "Tasnim Zaman", "rating": 4, "comment": "Love the style and it's very comfortable. The length was just right for me (5'4\")."},
      {"user": "Farah Dewan", "rating": 5, "comment": "Received so many compliments. Great for a summer day, doesn't stick to the skin."},
      {"user": "Sonia Ahmed", "rating": 4, "comment": "Beautiful dress. I found the sleeves to be a bit tight, but otherwise lovely."}
    ],
    "tags": ["dress", "floral", "summer", "A-line", "casual"],
    "createdAt": "2025-09-01T12:00:00Z",
    "updatedAt": "2025-09-01T12:00:00Z"
  },
  {
    "title": "Bodycon Midi Cocktail Dress",
    "description": "Command attention with this stunning Bodycon Midi Cocktail Dress, designed for a confident, sleek silhouette. Made from a high-quality stretchy blend of polyester and elastane, this dress hugs your curves in all the right places, offering both structure and incredible comfort. The sophisticated crew neck and elegant cap sleeves provide a classic look, while the knee-length hemline strikes the perfect balance between modern and timeless. Its internal smoothing panels ensure a flawless finish, making it ideal for cocktail parties, date nights, or formal dinners. The rich, solid color and minimalist design allow you to accessorize boldly with sparkling jewelry and a chic clutch. The fabric is durable, resists wrinkling, and maintains its shape throughout wear. Step out in style and feel empowered in this essential evening dress.",
    "price": 3200,
    "discountPrice": 2599,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Dress",
    "brand": "H&M",
    "rating": 4.4,
    "stock": 28,
    "featured": false,
    "sizes": ["XS", "S", "M", "L"],
    "images": ["https://img.drz.lazcdn.com/g/kf/S4da2452cd0a3441ea610624f2d6dcbddx.jpeg_720x720q80.jpg_.webp", "https://img.drz.lazcdn.com/g/kf/S114d2585db034d9e9baccb24438d19a5k.jpeg_720x720q80.jpg_.webp", "https://img.drz.lazcdn.com/g/kf/S114d2585db034d9e9baccb24438d19a5k.jpeg_720x720q80.jpg_.webp"],
    "reviews": [
      {"user": "Zara Khan", "rating": 5, "comment": "Fit like a glove! Felt amazing and confident at my friend's wedding. The material has great stretch."},
      {"user": "Nadia Islam", "rating": 4, "comment": "Very flattering dress. True to size. It's a bit shorter on me as I'm tall, but still wearable."},
      {"user": "Irin Parvez", "rating": 3, "comment": "The quality is good, but the fabric is quite thick. Might not be best for a hot summer evening."},
      {"user": "Meher Tabassum", "rating": 5, "comment": "Perfect for a night out. I got so many compliments. The dress holds you in nicely."}
    ],
    "tags": ["dress", "bodycon", "cocktail", "party", "midi"],
    "createdAt": "2025-08-30T15:45:00Z",
    "updatedAt": "2025-08-30T15:45:00Z"
  },
  {
    "title": "Bohemian Maxi Dress with Embroidery",
    "description": "Escape to a world of free-spirited charm with this beautiful Bohemian Maxi Dress. Flowing from a smocked, elasticated bodice, this dress offers a comfortable and adjustable fit for various body shapes. The lightweight, airy chiffon fabric layers create a dreamy, graceful movement with every step. The true highlight is the intricate handcrafted embroidery adorning the neckline and sleeves, adding a unique artisan touch. With its long, flowing sleeves and floor-length skirt, this dress is perfect for music festivals, beach vacations, or any boho-chic inspired event. The relaxed fit makes it incredibly comfortable for all-day wear. Layer it with a belt to define your waist and complete the look with leather sandals and layered necklaces for an authentic bohemian vibe. A statement piece that embodies effortless style and wanderlust.",
    "price": 2800,
    "discountPrice": 2299,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Dress",
    "brand": "Global Desi",
    "rating": 4.7,
    "stock": 19,
    "featured": true,
    "sizes": ["S", "M", "L"],
    "images": ["https://m.media-amazon.com/images/I/71rwaEH6-4L._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/71DUmuH-Q+L._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61XRsMo-BRL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Lubaba Haque", "rating": 5, "comment": "An absolutely gorgeous dress. The embroidery is detailed and the fabric flows beautifully."},
      {"user": "Sanjida Alam", "rating": 5, "comment": "I felt like a goddess wearing this at a destination wedding. So comfortable and photogenic!"},
      {"user": "Tanisha Roy", "rating": 4, "comment": "Love the boho style. The smocked top is very forgiving. It's a bit long, I needed heels."},
      {"user": "Fariha Yasmin", "rating": 5, "comment": "The quality is outstanding. It's a unique piece that stands out from typical maxi dresses."}
    ],
    "tags": ["dress", "maxi", "bohemian", "embroidery", "boho"],
    "createdAt": "2025-08-29T11:20:00Z",
    "updatedAt": "2025-08-29T11:20:00Z"
  },
  {
    "title": "Wrap Front Tiered Midi Dress",
    "description": "Discover universally flattering style with this elegant Wrap Front Tiered Midi Dress. The classic wrap design creates a beautiful V-neckline and allows you to adjust the fit perfectly around your waist, catering to all body types. The dress is made from a soft, crinkled rayon fabric that drapes exquisitely and feels luxurious against the skin. Its defining feature is the flowing, asymmetrical tiered skirt that adds movement, volume, and a touch of romantic drama. The tie belt cinches the waist to create an hourglass silhouette, while the midi length makes it appropriate for both daytime and evening occasions. Whether you're heading to the office, a summer wedding, or a dinner date, this versatile dress ensures you look polished and put-together. Its timeless design transcends seasons, making it a valuable long-term addition to your closet.",
    "price": 2600,
    "discountPrice": 2199,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Dress",
    "brand": "Mango",
    "rating": 4.8,
    "stock": 31,
    "featured": false,
    "sizes": ["S", "M", "L", "XL"],
    "images": ["https://m.media-amazon.com/images/I/61JCT0+r8JL._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/71LKd1LRT-L._AC_SY550_.jpg", "https://m.media-amazon.com/images/I/71pdy0n6LvL._AC_SY550_.jpg"],
    "reviews": [
      {"user": "Maria Siddiqui", "rating": 5, "comment": "This dress is magic! The wrap design is so flattering and the tiered skirt is beautiful."},
      {"user": "Disha Chakma", "rating": 5, "comment": "Incredibly comfortable and stylish. I've worn it to a wedding and to work. Versatile and elegant."},
      {"user": "Anila Farooq", "rating": 4, "comment": "The fabric is lovely and light. I just wish it had pockets!"},
      {"user": "Sharmin Akter", "rating": 5, "comment": "The fit is adjustable so it's perfect. I get compliments every time I wear it. A must-have."}
    ],
    "tags": ["dress", "wrap", "midi", "tiered", "elegant"],
    "createdAt": "2025-08-28T14:10:00Z",
    "updatedAt": "2025-08-28T14:10:00Z"
  },
  {
    "title": "Denim Shirt Dress with Belt",
    "description": "Master the art of casual cool with this classic Denim Shirt Dress. This versatile piece is crafted from medium-weight, soft denim that provides structure without sacrificing comfort. Designed like an oversized shirt, it features a pointed collar, a full button-down front, and long sleeves with buttoned cuffs. The included self-tie belt allows you to define your waist for a more polished silhouette or leave it open for a relaxed, laid-back vibe. With its practical chest pockets and knee-length cut, this dress is a workhorse for your wardrobe. Style it with sneakers and a backpack for a day of errands, or dress it up with ankle boots and a wide-brim hat for a trendy urban look. Durable, easy to wear, and endlessly stylish, this denim dress is a timeless investment that will serve you season after season.",
    "price": 2400,
    "discountPrice": 1999,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Dress",
    "brand": "ZARA",
    "rating": 4.5,
    "stock": 40,
    "featured": true,
    "sizes": ["XS", "S", "M", "L"],
    "images": ["https://m.media-amazon.com/images/I/71exe4Bu2YL._AC_SY550_.jpg", "https://m.media-amazon.com/images/I/61dXzXYd4FL._AC_SY550_.jpg", "https://m.media-amazon.com/images/I/913zdYBoHML._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Tahmina Hossain", "rating": 4, "comment": "A great staple dress. Perfect for casual Fridays at the office. The belt is a nice touch."},
      {"user": "Nusrat Jahan", "rating": 5, "comment": "I live in this dress! So easy to throw on and look put together. The denim is soft."},
      {"user": "Roksana Ali", "rating": 4, "comment": "Love the style. It runs a bit large, so I'd recommend sizing down for a fitted look."},
      {"user": "Sabrina Karim", "rating": 5, "comment": "Very versatile. I've layered it over turtlenecks in winter. A true year-round piece."}
    ],
    "tags": ["dress", "denim", "shirt dress", "casual", "belted"],
    "createdAt": "2025-08-27T10:05:00Z",
    "updatedAt": "2025-08-27T10:05:00Z"
  },

  
  {
    "title": "Handloom Cotton Tant Saree with Broad Border",
    "description": "Experience the timeless elegance of Bengal with this authentic Handloom Cotton Tant Saree. Woven by skilled artisans using traditional techniques, this saree is celebrated for its breathability and featherlight comfort, making it perfect for humid weather and long hours of wear. The saree features a crisp texture and a vibrant, colorful broad border (aachol) that contrasts beautifully with the minimalist body. The pallu is adorned with traditional motifs, often inspired by nature and folk art. Known for its durability, this pure cotton saree becomes softer with every wash. It is an ideal choice for daily wear, cultural events, and festive occasions like Pohela Boishakh. Pair it with a simple cotton blouse for a traditional look or a contemporary designer blouse for a modern twist. Supporting handloom also means supporting the heritage and livelihood of weaver communities.",
    "price": 1850,
    "discountPrice": 1499,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Saree",
    "brand": "Tangail Saree Kutir",
    "rating": 4.8,
    "stock": 50,
    "featured": true,
    "sizes": ["Free Size"],
    "images": ["https://m.media-amazon.com/images/I/61ZrVfxpoeL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/81WadSD-O2L._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/71iwr2QXThL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Bipasha Das", "rating": 5, "comment": "A pure classic! The cotton is so breathable and the weave is impeccable. Perfect for summer."},
      {"user": "Anindita Roy", "rating": 5, "comment": "The colors are vibrant and the border work is exquisite. A proud purchase of our heritage."},
      {"user": "Sneha Chakraborty", "rating": 4, "comment": "Beautiful saree. It did have a slight starchiness initially, but washed out perfectly."},
      {"user": "Priyanka Saha", "rating": 5, "comment": "Extremely comfortable and drapes like a dream. Will definitely buy more colors."}
    ],
    "tags": ["saree", "tant", "cotton", "handloom", "traditional"],
    "createdAt": "2025-09-05T08:30:00Z",
    "updatedAt": "2025-09-05T08:30:00Z"
  },
  {
    "title": "Art Silk Kanjivaram Party Wear Saree",
    "description": "Make a grand entrance at any wedding or festive gathering in this magnificent Art Silk Kanjivaram Saree. This saree mimics the richness and grandeur of a pure silk Kanjivaram but at a more accessible price point, thanks to its high-quality artificial silk fabric. It features a heavy zari work border and pallu, intricately woven with traditional patterns and motifs, gleaming with a luxurious gold and silver finish. The body of the saree often has contrasting checks or stripes, adding to its regal appeal. The fabric has a beautiful drape and a slight sheen that catches the light elegantly. Despite its lavish appearance, it is relatively easy to maintain compared to pure silk. This statement piece is designed for those who want to look opulent and feel confident at the most important celebrations.",
    "price": 5500,
    "discountPrice": 4499,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Saree",
    "brand": "Kalanjali",
    "rating": 4.7,
    "stock": 18,
    "featured": true,
    "sizes": ["Free Size"],
    "images": ["https://m.media-amazon.com/images/I/61sW4+lY-pL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/71nQh+DZtZL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/71uww26RG0L._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Sunanda Mehta", "rating": 5, "comment": "Wore this to my niece's wedding. Felt like a queen! The zari work is stunning and heavy."},
      {"user": "Deepika Agarwal", "rating": 4, "comment": "Looks every bit as expensive as a real Kanjivaram. The fall is beautiful. A bit slippery to drape."},
      {"user": "Rajani Iyer", "rating": 5, "comment": "The color combination is rich and traditional. Received countless compliments."},
      {"user": "Lakshmi P", "rating": 4, "comment": "Excellent value for money. The craftsmanship is detailed and the saree has a good weight to it."}
    ],
    "tags": ["saree", "kanjivaram", "art silk", "party wear", "zari"],
    "createdAt": "2025-09-04T14:15:00Z",
    "updatedAt": "2025-09-04T14:15:00Z"
  },
  {
    "title": "Soft Net Saree with Embroidered Blouse",
    "description": "Radiate contemporary glamour with this elegant Soft Net Saree. This modern ensemble is perfect for receptions, parties, and formal events where you want to stand out. The sheer, soft net base is overlaid with intricate embroidery, sequin work, or appliques, creating a delicate and sophisticated pattern. This particular set comes with a matching, readymade embroidered blouse, ensuring a perfect color match and a coordinated high-fashion look. The net fabric is gentle on the skin and allows for beautiful, flowing drapes. The transparency of the net is expertly balanced with the opaqueness of the embroidery, making it stylish yet appropriate. It's lighter than a traditional heavily embroidered saree, making it more comfortable for dancing and socializing through the night. A go-to choice for the fashion-forward woman.",
    "price": 4200,
    "discountPrice": 3499,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Saree",
    "brand": "Bollywood Trends",
    "rating": 4.6,
    "stock": 25,
    "featured": false,
    "sizes": ["Free Size"],
    "images": ["https://m.media-amazon.com/images/I/61YQlDQ4eoL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61yjAc9o1AL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/71HoNSjbXhL._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Nazia Hassan", "rating": 5, "comment": "The embroidery is gorgeous and the included blouse fits perfectly. Felt very glamorous."},
      {"user": "Ayesha Siddiqui", "rating": 4, "comment": "Lightweight and beautiful. The net is soft, not scratchy. The work is delicate so handle with care."},
      {"user": "Farah Khan", "rating": 5, "comment": "Perfect for a DJ night. It's easy to carry and doesn't feel heavy. Loved it!"},
      {"user": "Zara Malik", "rating": 4, "comment": "The color is vibrant. The only con is that it requires a lot of pins to drape securely due to the net."}
    ],
    "tags": ["saree", "net", "embroidered", "party", "modern"],
    "createdAt": "2025-09-03T11:50:00Z",
    "updatedAt": "2025-09-03T11:50:00Z"
  },
  {
    "title": "Organza Saree with Floral Prints",
    "description": "Embrace a fresh and youthful vibe with this chic Organza Saree featuring bold floral prints. Organza, a crisp and sheer fabric, holds its structure well, giving the saree a beautiful volume and shape when draped. The modern floral prints are spread across the sheer fabric, creating a playful and romantic look. This saree is lightweight, airy, and has a subtle shimmer, making it perfect for daytime parties, summer weddings, or festive brunches. It is often paired with a contrasting solid-colored blouse to make the prints pop. While it looks delicate, high-quality organza is surprisingly resilient. This saree is a fantastic choice for those who want to move away from traditional weaves and experiment with a more contemporary, printed aesthetic without sacrificing the elegance of a saree.",
    "price": 2700,
    "discountPrice": 2199,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Saree",
    "brand": "Aurelia",
    "rating": 4.5,
    "stock": 40,
    "featured": true,
    "sizes": ["Free Size"],
    "images": ["https://m.media-amazon.com/images/I/618LED-CqkL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61152nYRpML._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61vgCpNVFVL._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Tuli Sengupta", "rating": 4, "comment": "Such a pretty saree! The prints are lovely and it's very comfortable to wear. It's sheer, so needs a right petticoat."},
      {"user": "Debjani Ghosh", "rating": 5, "comment": "Perfect for a spring wedding. It's different from everything else in my wardrobe. Love it."},
      {"user": "Ishita Dey", "rating": 4, "comment": "The fabric has a nice stiffness that helps in draping easily. The colors are very fresh."},
      {"user": "Rimi Basak", "rating": 5, "comment": "Got this for a friend's engagement. It was a hit! Very unique and stylish."}
    ],
    "tags": ["saree", "organza", "floral", "print", "modern"],
    "createdAt": "2025-09-02T16:40:00Z",
    "updatedAt": "2025-09-02T16:40:00Z"
  },
  {
    "title": "Bengal Korial Cotton Silk Saree",
    "description": "The Bengal Korial is the epitome of understated elegance, seamlessly blending the comfort of cotton with the slight sheen of silk. This saree is a beloved staple for Bengali women, especially for religious ceremonies and cultural events. Woven with a cotton warp and silk weft, it offers the best of both worlds: the breathability and matte finish of cotton with the smooth texture and delicate lustre of silk. It typically features a simple but elegant body with a distinct, often intricately designed, border and pallu. The saree drapes beautifully and is more durable than pure silk. Its minimalist sophistication makes it a versatile piece that can be worn for a wide range of occasions, from a day at the office to an evening puja ceremony. It is a timeless investment in tradition and comfort.",
    "price": 3500,
    "discountPrice": 2999,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Saree",
    "brand": "Weavers Village",
    "rating": 4.9,
    "stock": 30,
    "featured": false,
    "sizes": ["Free Size"],
    "images": ["https://m.media-amazon.com/images/I/81-U+mPk-rL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/813SV1WmfqL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/81ovE6X7j6L._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Aloka Sen", "rating": 5, "comment": "This is my go-to saree for every auspicious occasion. The blend is perfect - comfortable yet elegant."},
      {"user": "Sharmistha Bose", "rating": 5, "comment": "The authenticity of the weave is evident. The touch is so soft and it gets better with every wash."},
      {"user": "Moumita Dutta", "rating": 5, "comment": "A classic piece that every woman should own. The fall is superb and it's so easy to maintain."},
      {"user": "Indrani Roy", "rating": 4, "comment": "Beautiful traditional saree. The silk blend gives it just the right amount of shine without being over the top."}
    ],
    "tags": ["saree", "korial", "cotton silk", "traditional", "bengali"],
    "createdAt": "2025-09-01T10:00:00Z",
    "updatedAt": "2025-09-01T10:00:00Z"
  },

  
  {
    "title": "Classic Leather Tote Bag",
    "description": "Meet your new everyday essential: the Classic Leather Tote Bag. Crafted from premium, supple genuine leather, this tote is designed for both durability and sophisticated style. Its spacious main compartment effortlessly accommodates a laptop (up to 15 inches), notebooks, a wallet, and all your daily necessities, making it perfect for work, college, or a day of shopping. The bag features sturdy dual handles for a comfortable carry on your shoulder or in your hand, along with an optional, adjustable shoulder strap for hands-free convenience. Inside, a zippered pocket and two open slip pockets help you stay organized. The minimalist design with clean lines and subtle branding ensures it complements any outfit, from professional attire to casual weekend wear. This tote ages beautifully, developing a unique patina over time. It's more than a bag; it's a reliable and elegant companion for the modern woman on the go.",
    "price": 3800,
    "discountPrice": 3199,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "Hazel",
    "rating": 4.8,
    "stock": 28,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/81ATlZH9zmL._AC_SY695_.jpg", "https://m.media-amazon.com/images/I/81F7HM9-PNL._AC_SY575_.jpg", "https://m.media-amazon.com/images/I/81AxmFHPOhL._AC_SY575_.jpg"],
    "reviews": [
      {"user": "Nabila Islam", "rating": 5, "comment": "The quality of the leather is outstanding. It fits my laptop and everything else I need. Highly recommend!"},
      {"user": "Tahsin Ahmed", "rating": 4, "comment": "A very stylish and practical bag. The only reason for 4 stars is that it's a bit heavy when empty."},
      {"user": "Samira Khan", "rating": 5, "comment": "Perfect for work. It looks professional and has so much space. The leather smell is amazing."},
      {"user": "Fariha Tasnim", "rating": 5, "comment": "I've used it every day for 3 months and it still looks brand new. Very well-made."}
    ],
    "tags": ["bag", "tote", "leather", "work", "laptop bag"],
    "createdAt": "2025-08-30T09:15:00Z",
    "updatedAt": "2025-08-30T09:15:00Z"
  },
  {
    "title": "Quilted Chain Crossbody Bag",
    "description": "Add a touch of luxury to your ensemble with this elegant Quilted Chain Crossbody Bag. Inspired by classic designs, this bag features a beautifully quilted pattern with a luxurious sheen, accented by a elegant logo turn-lock closure. The durable, gold-tone chain strap is both a style statement and a functional element, allowing you to wear it as a crossbody for security and convenience or double it to carry as a chic shoulder bag. Perfect for evenings out, parties, or when you want to travel light, its compact size is deceptively spacious, holding your phone, keys, lipstick, and cards securely. The interior is lined with soft fabric and includes a slip pocket for organization. Made from high-quality vegan leather, it offers a luxurious look and feel without compromise. This bag is the ultimate accessory to elevate any little black dress or jeans-and-tee combo.",
    "price": 2500,
    "discountPrice": 1999,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "La Elle",
    "rating": 4.6,
    "stock": 45,
    "featured": false,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/81poiWkWQFL._AC_SY695_.jpg", "https://m.media-amazon.com/images/I/814+E3mx-eL._AC_SY575_.jpg", "https://m.media-amazon.com/images/I/71erfgHCLCL._AC_SY575_.jpg"],
    "reviews": [
      {"user": "Zara Malik", "rating": 5, "comment": "So chic! I get compliments every time I wear it. The chain feels sturdy and not cheap at all."},
      {"user": "Maria Siddiqua", "rating": 4, "comment": "Beautiful bag for a night out. It fits the essentials but is a bit small for a full-size wallet."},
      {"user": "Anika Rahman", "rating": 5, "comment": "The perfect party bag. The quilted design and chain strap make it look so expensive."},
      {"user": "Roksana Haque", "rating": 4, "comment": "Love the style and versatility. The material is good, but I'm careful with the quilting to avoid snags."}
    ],
    "tags": ["bag", "crossbody", "quilted", "chain strap", "evening bag"],
    "createdAt": "2025-08-29T14:20:00Z",
    "updatedAt": "2025-08-29T14:20:00Z"
  },
  {
    "title": "Bohemian Macrame Beach Bag",
    "description": "Carry your summer essentials in style with this charming Bohemian Macrame Beach Bag. Handcrafted by skilled artisans, this tote features intricate macrame knots made from durable cotton cord, creating a unique and eye-catching pattern. It's lined with a sturdy, waterproof canvas material, making it ideal for beach trips, poolside lounging, or casual weekend farmers' market visits. The bag is incredibly roomy, large enough to hold a beach towel, sunscreen, a book, a water bottle, and more. It features two sturdy handles for carrying and an open top for easy access. The natural, earthy tones and artisanal design embody a free-spirited, boho-chic vibe. Not just for the beach, this ethical and sustainable fashion statement pairs beautifully with maxi dresses and casual summer outfits, adding a textural, handmade element to your look.",
    "price": 1600,
    "discountPrice": 1299,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "Boho Spirit",
    "rating": 4.7,
    "stock": 60,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/61Dyvab5v6L._AC_SY695_.jpg", "https://m.media-amazon.com/images/I/61VTym8mnyL._AC_SY575_.jpg", "https://m.media-amazon.com/images/I/61DbPQiO5xL._AC_SY575_.jpg"],
    "reviews": [
      {"user": "Lubaba Hasan", "rating": 5, "comment": "This bag is gorgeous and so well-made! It was perfect for my vacation. Held all my beach stuff."},
      {"user": "Tanisha Roy", "rating": 5, "comment": "I love supporting handmade products. The craftsmanship is beautiful and it's very sturdy."},
      {"user": "Sanjida Alam", "rating": 4, "comment": "Beautiful and functional. The only downside is that small things can fall out through the macrame holes."},
      {"user": "Fariha Yasmin", "rating": 5, "comment": "So unique! I use it as my everyday summer bag. It's lightweight and goes with everything."}
    ],
    "tags": ["bag", "tote", "macrame", "beach bag", "boho"],
    "createdAt": "2025-08-28T11:05:00Z",
    "updatedAt": "2025-08-28T11:05:00Z"
  },
  {
    "title": "Mini Backpack Purse",
    "description": "Embrace hands-free fun and modern style with this adorable Mini Backpack Purse. This compact backpack offers the casual, youthful vibe of a backpack with the polished look of a purse. Made from high-quality faux leather, it features a sleek design with a smooth zipper closure across the top and adjustable, comfortable straps. Despite its 'mini' label, it is cleverly designed to hold your phone, keys, wallet, and makeup essentials with ease. It's the perfect choice for concerts, festivals, shopping trips, or any day when you need to keep your hands free. The modern design looks great with jeans, sneakers, and a tee, but can also add a cool, unexpected edge to a dress. A versatile and trendy accessory that combines practicality with undeniable style.",
    "price": 1800,
    "discountPrice": 1499,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "Urban Trend",
    "rating": 4.5,
    "stock": 55,
    "featured": false,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/61kfTv5jvLL._AC_SX522_.jpg", "https://m.media-amazon.com/images/I/61zmjJK4cqL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/61BAR4rVgeL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Nadia Islam", "rating": 4, "comment": "Super cute and convenient. I use it for running errands. The size is perfect for not carrying too much junk."},
      {"user": "Irin Parvez", "rating": 5, "comment": "So comfortable to wear! The straps are padded and it's very lightweight. Love the modern look."},
      {"user": "Meher Tabassum", "rating": 4, "comment": "Great for travel days at the airport. Fits my passport and important documents. Zipper is smooth."},
      {"user": "Sabrina Karim", "rating": 5, "comment": "This is my favorite casual bag. It's stylish, practical, and goes with almost all my casual outfits."}
    ],
    "tags": ["bag", "backpack", "mini", "hands-free", "casual"],
    "createdAt": "2025-08-27T16:50:00Z",
    "updatedAt": "2025-08-27T16:50:00Z"
  },
  {
    "title": "Structured Satchel with Top Handle",
    "description": "Achieve a polished, professional look with this sophisticated Structured Satchel. Defined by its clean, geometric lines and rigid structure, this bag exudes confidence and order. Crafted from a high-quality Saffiano-style textured leather that is resistant to scratches and water, it maintains its pristine shape through daily use. The bag features a top handle for a classic carry, as well as a detachable and adjustable shoulder strap for versatility. The secure front flap with a magnetic closure reveals a spacious, well-organized interior with multiple compartments, including a zippered pocket and slip pockets for your phone, pen, and cards. Ideal for the office, interviews, or any formal setting, this satchel holds its own while keeping your belongings neatly arranged. It's a timeless investment piece that signifies taste and professionalism.",
    "price": 3200,
    "discountPrice": 2699,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "Corporate Chic",
    "rating": 4.7,
    "stock": 22,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/71+5matS03L._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/71Gwa9ARh1L._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/71sidF3xtOL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Asma Akter", "rating": 5, "comment": "This bag makes me feel so put-together. It's incredibly well-structured and the organization is a dream."},
      {"user": "Jannatul Ferdous", "rating": 5, "comment": "The quality is exceptional. It looks much more expensive than it is. Perfect for my corporate job."},
      {"user": "Sharmin Sultana", "rating": 4, "comment": "Love the professional look. The only thing is that the magnetic closure is very strong, almost too strong."},
      {"user": "Tania Haq", "rating": 5, "comment": "Worth every penny. The structure doesn't sag even when full. A classic piece that will never go out of style."}
    ],
    "tags": ["bag", "satchel", "structured", "office", "professional"],
    "createdAt": "2025-08-26T10:30:00Z",
    "updatedAt": "2025-08-26T10:30:00Z"
  },

  
  {
    "title": "Classic Leather Tote Bag",
    "description": "Carry your essentials in style and sophistication with this timeless Classic Leather Tote Bag. Crafted from genuine, high-quality leather, this bag boasts a soft yet durable texture that develops a beautiful patina over time, adding to its character. Its spacious, open-top main compartment is perfect for a laptop (up to 13 inches), notebooks, a water bottle, and all your daily necessities. Features include two internal pockets to keep your phone and keys organized, and two sturdy top handles for a comfortable carry on your shoulder or in your hand. The minimalist design, clean lines, and subtle branding make it a versatile accessory that transitions seamlessly from a professional office setting to a casual weekend outing. This tote is an investment piece, built to last for years and complement virtually any outfit in your wardrobe.",
    "price": 4500,
    "discountPrice": 3799,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "Hazel",
    "rating": 4.8,
    "stock": 25,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["", "", ""],
    "reviews": [
      {"user": "Nabila Islam", "rating": 5, "comment": "The leather quality is exceptional for the price. It's my everyday work bag and has held up perfectly."},
      {"user": "Tahsin Ahmed", "rating": 4, "comment": "Very stylish and spacious. I wish it had a zipper closure for extra security, but I love it overall."},
      {"user": "Fariha Tasnim", "rating": 5, "comment": "Gets compliments every time I use it. The leather smells amazing and feels so luxurious."},
      {"user": "Samira Haq", "rating": 5, "comment": "The perfect size! Fits my laptop and everything else I need. A very practical and chic bag."}
    ],
    "tags": ["bag", "tote", "leather", "office", "casual"],
    "createdAt": "2025-08-30T09:15:00Z",
    "updatedAt": "2025-08-30T09:15:00Z"
  },
  {
    "title": "Quilted Chain Crossbody Bag",
    "description": "Add a touch of luxury to your ensemble with this elegant Quilted Chain Crossbody Bag. Inspired by classic designs, this bag features a beautifully quilted pattern with a chic twist-lock closure, giving it an instantly recognizable upscale appeal. The adjustable chain strap allows you to wear it as a crossbody for hands-free convenience or double it up to carry it as a stylish shoulder bag. Crafted from high-quality synthetic leather that mimics the look and feel of the real thing, it is both durable and ethical. The interior is thoughtfully designed with multiple card slots and a main compartment to securely hold your phone, wallet, lipstick, and keys. Perfect for evenings out, brunches, or any occasion where you want to travel light but look polished. This bag is a statement piece that elevates any outfit, from jeans and a tee to a little black dress.",
    "price": 2200,
    "discountPrice": 1899,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "La Maison",
    "rating": 4.6,
    "stock": 45,
    "featured": false,
    "sizes": ["One Size"],
    "images": ["", "", ""],
    "reviews": [
      {"user": "Zara Khan", "rating": 5, "comment": "So chic and perfect for a night out! The chain feels sturdy and the quilting is very well done."},
      {"user": "Maria Sultana", "rating": 4, "comment": "Love the design and it fits all my essentials. The only downside is it's a bit smaller than it looks in pictures."},
      {"user": "Rebecca Costa", "rating": 5, "comment": "This bag goes with everything. I've used it so many times already. Great value for money."},
      {"user": "Anika Chowdhury", "rating": 4, "comment": "Beautiful bag. The hardware is good quality and hasn't tarnished. Very happy with the purchase."}
    ],
    "tags": ["bag", "crossbody", "quilted", "evening", "chain strap"],
    "createdAt": "2025-08-29T14:20:00Z",
    "updatedAt": "2025-08-29T14:20:00Z"
  },
  {
    "title": "Bohemian Embroidered Canvas Sling Bag",
    "description": "Channel your inner free spirit with this vibrant Bohemian Embroidered Canvas Sling Bag. This bag is a work of art, featuring intricate, colorful hand-embroidery or applique work on a sturdy canvas base, often depicting floral or mandala patterns. The adjustable fabric strap allows for a comfortable crossbody fit, making it ideal for festivals, vacations, or adding a pop of color to your casual daytime looks. The spacious main compartment closes with a drawstring or zip, and it often includes inner pockets for organization. Lightweight, durable, and uniquely stylish, this bag is a conversation starter. It reflects a carefree, artistic vibe and is perfect for those who love to express their individuality through their accessories. Pair it with a maxi dress, denim shorts, or a flowy skirt for a complete boho-chic outfit.",
    "price": 1500,
    "discountPrice": 1299,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "Boho Spirit",
    "rating": 4.7,
    "stock": 60,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["", "", ""],
    "reviews": [
      {"user": "Lubaba Haque", "rating": 5, "comment": "The embroidery is absolutely stunning! So detailed and vibrant. Perfect for my holiday."},
      {"user": "Tanisha Roy", "rating": 5, "comment": "I get stopped everywhere I go asking where I got this bag. It's unique and very well made."},
      {"user": "Sanjida Alam", "rating": 4, "comment": "Love the boho style and it's surprisingly roomy. The canvas is thick and good quality."},
      {"user": "Fariha Yasmin", "rating": 4, "comment": "Beautiful bag. The colors are true to the picture. A fun accessory to brighten any outfit."}
    ],
    "tags": ["bag", "sling", "bohemian", "embroidered", "canvas"],
    "createdAt": "2025-08-28T11:05:00Z",
    "updatedAt": "2025-08-28T11:05:00Z"
  },
  {
    "title": "Mini Backpack Purse",
    "description": "Embrace a hands-free, trendy look with this adorable and practical Mini Backpack Purse. Combining the casual coolness of a backpack with the sophistication of a purse, this style is a modern wardrobe essential. Made from faux leather or durable nylon, it features two adjustable straps for a comfortable fit on your back, freeing up your hands for your phone, coffee, or shopping bags. Despite its 'mini' label, it is deceptively spacious, with enough room for your wallet, phone, keys, sunglasses, and makeup essentials. It often includes multiple zippered compartments for organization and external pockets for quick access. This versatile bag is perfect for shopping trips, concerts, travel days, or simply for adding a youthful and sporty edge to your everyday style. A must-have for the active, fashion-conscious woman on the go.",
    "price": 1800,
    "discountPrice": 1499,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "Urban Gear",
    "rating": 4.5,
    "stock": 55,
    "featured": false,
    "sizes": ["One Size"],
    "images": ["", "", ""],
    "reviews": [
      {"user": "Nadia Islam", "rating": 4, "comment": "So convenient for when I'm running errands. Fits all my essentials and is super comfortable to wear."},
      {"user": "Irin Parvez", "rating": 5, "comment": "This is my favorite casual bag. It's cute, functional, and goes with my streetwear style perfectly."},
      {"user": "Meher Tabassum", "rating": 4, "comment": "Great quality for the price. The zippers are smooth and the material is easy to wipe clean."},
      {"user": "Sonia Ahmed", "rating": 5, "comment": "Bought this for a trip and it was a lifesaver at the airport. Hands-free is the way to go!"}
    ],
    "tags": ["bag", "backpack", "mini", "casual", "hands-free"],
    "createdAt": "2025-08-27T16:50:00Z",
    "updatedAt": "2025-08-27T16:50:00Z"
  },
  {
    "title": "Structured Satchel with Top Handle",
    "description": "Achieve a polished and professional look with this elegant Structured Satchel. Defined by its rigid, boxy shape and clean architectural lines, this bag exudes confidence and organization. It is typically crafted from pebbled or smooth leather (or high-quality faux leather) and features a top handle for a classic carry, as well as a detachable shoulder strap for versatility. The front often has a turn-lock or buckle closure, adding to its secure and sophisticated aesthetic. Inside, you'll find a well-organized interior with lined compartments, pen slots, and a zip pocket, making it ideal for keeping your work items neatly in place. This satchel is the perfect companion for the office, interviews, or any formal business setting. It holds its shape impeccably, ensuring you look put-together from the moment you step out the door.",
    "price": 3800,
    "discountPrice": 3299,
    "currency": "BDT",
    "category": "Women Fashion",
    "subCategory": "Bags",
    "brand": "Executive Chic",
    "rating": 4.7,
    "stock": 20,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["", "", ""],
    "reviews": [
      {"user": "Sabrina Karim", "rating": 5, "comment": "This bag makes me feel so powerful and professional. The structure is amazing and it's very well-made."},
      {"user": "Roksana Ali", "rating": 5, "comment": "The organization inside is a dream! Everything has its place. Perfect for my work documents."},
      {"user": "Tahmina Hossain", "rating": 4, "comment": "Love the professional look. It is a bit heavy when empty, but that's expected given its structure."},
      {"user": "Nusrat Jahan", "rating": 5, "comment": "A classic piece that will never go out of style. The hardware is robust and the leather is top-notch."}
    ],
    "tags": ["bag", "satchel", "structured", "office", "professional"],
    "createdAt": "2025-08-26T10:30:00Z",
    "updatedAt": "2025-08-26T10:30:00Z"
  },

  
  {
    "title": "Slim Fit Casual Cotton Shirt",
    "description": "Upgrade your everyday wardrobe with this Slim Fit Casual Cotton Shirt, designed for men who value comfort without compromising style. Made from 100% premium cotton, this shirt offers breathability, softness, and durability, making it perfect for daily wear or office meetings. The tailored slim fit provides a modern silhouette that enhances your physique, while the button-down collar adds a classic touch. Its versatile design allows it to be paired effortlessly with jeans, chinos, or formal trousers. The shirt features a single chest pocket for convenience and subtle stitch detailing for added elegance. Easy to maintain and machine washable, this cotton shirt retains its shape and color after multiple washes. Ideal for casual outings, semi-formal events, or work environments, it effortlessly combines style and practicality. The shirt is available in multiple colors to match any personal style or occasion, making it a staple in any man’s wardrobe. This piece is designed to offer both comfort and a sophisticated appearance, ensuring you look polished while staying relaxed throughout the day.",
    "price": 2500,
    "discountPrice": 1999,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "UrbanTrend",
    "rating": 4.6,
    "stock": 30,
    "featured": true,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/91B0P-ZMo2L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81ltgm0e38L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/818-iUwXHgL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Arif Hossain", "rating": 5, "comment": "The shirt fits perfectly and the cotton is soft. Great value for money."},
      {"user": "Rashed Khan", "rating": 4, "comment": "Stylish and comfortable. I wear it for office and casual meetups."},
      {"user": "Jahid Islam", "rating": 5, "comment": "Good quality stitching and material. Looks premium."},
      {"user": "Imran Ali", "rating": 4, "comment": "Color is exactly as shown. Slim fit is perfect."}
    ],
    "tags": ["men", "shirt", "cotton", "casual", "slim fit"],
    "createdAt": "2025-09-11T10:00:00Z",
    "updatedAt": "2025-09-11T10:00:00Z"
  },
  {
    "title": "Formal Striped Office Shirt",
    "description": "Step up your professional game with this Formal Striped Office Shirt, tailored for men who want to exude confidence and sophistication. Crafted from high-quality cotton-polyester blend, it ensures comfort throughout long working hours while maintaining a crisp, wrinkle-free look. The vertical stripes create a visually slimming effect and add a refined touch to your office attire. Equipped with a button-down collar and adjustable cuffs, this shirt allows for a polished and tailored appearance. Ideal for pairing with suits, blazers, or formal trousers, it seamlessly transitions from day office meetings to evening events. Designed for durability and easy care, the fabric resists wear and maintains color vibrancy even after repeated washing. With attention to detail in stitching and finishing, this shirt delivers both elegance and practicality. Available in multiple classic colors, it fits effortlessly into a professional wardrobe. Its breathable material ensures that you stay comfortable without sacrificing style, making it a must-have for modern men seeking timeless office attire.",
    "price": 3200,
    "discountPrice": 2699,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "ExecutiveWear",
    "rating": 4.7,
    "stock": 20,
    "featured": false,
    "sizes": ["M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/61eIo5At15L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71Uj4bvI0zL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81g1lVCRpkL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Fahim Rahman", "rating": 5, "comment": "Perfect for office. Looks very professional and fits nicely."},
      {"user": "Tanvir Ahmed", "rating": 4, "comment": "Material is good. Stripes look sharp and elegant."},
      {"user": "Sabbir Hossain", "rating": 4, "comment": "Nice shirt but sizing runs slightly small."},
      {"user": "Rakib Khan", "rating": 5, "comment": "Excellent quality and design. Highly recommend for formal use."}
    ],
    "tags": ["men", "shirt", "formal", "striped", "office"],
    "createdAt": "2025-09-11T10:05:00Z",
    "updatedAt": "2025-09-11T10:05:00Z"
  },
  {
    "title": "Denim Casual Long Sleeve Shirt",
    "description": "Bring rugged sophistication to your casual wardrobe with this Denim Casual Long Sleeve Shirt. Made from premium, soft denim, it ensures durability and comfort for daily wear. The versatile design features buttoned cuffs and a classic collar, making it suitable for layering over t-shirts or under jackets. Its tailored fit accentuates the shoulders and torso while providing freedom of movement. Perfect for casual outings, evening gatherings, or weekend trips, this shirt combines style and functionality effortlessly. The denim fabric ages beautifully over time, creating a unique worn-in look that adds character to your outfits. Reinforced stitching and attention to detail ensure longevity, while its easy-to-care nature makes it ideal for busy lifestyles. The shirt is available in various washes and shades, giving you the flexibility to create multiple looks with a single wardrobe staple. Comfortable, stylish, and versatile, this denim shirt is an essential piece for modern men who appreciate casual fashion with a rugged twist.",
    "price": 2800,
    "discountPrice": 2299,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "DenimX",
    "rating": 4.5,
    "stock": 25,
    "featured": true,
    "sizes": ["S", "M", "L", "XL"],
    "images": ["https://m.media-amazon.com/images/I/81FsGjHzv6L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/61xhBH3PeVL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81lDaYgGr8L._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Shahriar Alam", "rating": 5, "comment": "Looks stylish and feels very comfortable."},
      {"user": "Nazmul Hossain", "rating": 4, "comment": "Nice denim texture. Perfect for casual outings."},
      {"user": "Arman Khan", "rating": 5, "comment": "Durable and well-fitted. Love the rugged look."},
      {"user": "Fahad Islam", "rating": 4, "comment": "Good quality but slightly tight on shoulders."}
    ],
    "tags": ["men", "shirt", "denim", "casual", "long sleeve"],
    "createdAt": "2025-09-11T10:10:00Z",
    "updatedAt": "2025-09-11T10:10:00Z"
  },
  {
    "title": "Linen Summer Beach Shirt",
    "description": "Stay cool and stylish during the summer with this Linen Summer Beach Shirt. Crafted from 100% lightweight linen, it offers maximum breathability and a relaxed fit, perfect for hot and humid weather. The airy fabric allows for ventilation while maintaining a crisp and neat appearance. Ideal for beach outings, vacations, or casual gatherings, the shirt features a button-front closure, classic collar, and roll-up sleeves secured with tabs. The natural texture of linen adds a laid-back, sophisticated charm, making it versatile for both daytime and evening wear. Available in soft pastel shades and neutral tones, it complements a wide range of summer outfits. Easy to pair with shorts, chinos, or light trousers, this shirt elevates your summer wardrobe while keeping comfort a priority. Durable and easy to maintain, it withstands frequent wear and washing. Whether you’re strolling on the beach or enjoying a casual brunch, this linen shirt ensures you stay stylish, comfortable, and effortlessly relaxed throughout the day.",
    "price": 2700,
    "discountPrice": 2199,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "SunStyle",
    "rating": 4.6,
    "stock": 15,
    "featured": false,
    "sizes": ["M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/61eX6xUn7gL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/71RWIPl2XnL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81oZBaGn6FL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Irfan Hossain", "rating": 5, "comment": "Super light and comfortable. Perfect for summer."},
      {"user": "Shuvo Alam", "rating": 4, "comment": "Feels premium and keeps me cool."},
      {"user": "Rafiq Khan", "rating": 5, "comment": "Great for beach and casual outings."},
      {"user": "Monir Hossain", "rating": 4, "comment": "Nice linen texture, very breathable."}
    ],
    "tags": ["men", "shirt", "linen", "summer", "beach"],
    "createdAt": "2025-09-11T10:15:00Z",
    "updatedAt": "2025-09-11T10:15:00Z"
  },
  {
    "title": "Checked Flannel Winter Shirt",
    "description": "Embrace warmth and style with this Checked Flannel Winter Shirt, crafted to keep you cozy without compromising fashion. Made from soft brushed flannel, this shirt provides superior insulation and comfort for chilly days. The classic check pattern gives a rugged yet stylish appearance, suitable for casual and semi-formal settings. Featuring buttoned cuffs, a button-down collar, and a front chest pocket, it combines practicality with aesthetic appeal. Perfect for layering over t-shirts or under jackets, it adds versatility to your winter wardrobe. Its durable fabric withstands repeated washing while retaining color and softness. Available in multiple color combinations, it fits effortlessly into any casual or outdoor ensemble. Whether worn for weekend trips, casual office days, or outdoor adventures, this flannel shirt ensures both warmth and style. Easy to pair with jeans, chinos, or corduroy pants, it becomes a staple for the modern man seeking functional yet fashionable winter wear.",
    "price": 3000,
    "discountPrice": 2499,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "WinterWear",
    "rating": 4.7,
    "stock": 20,
    "featured": true,
    "sizes": ["M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/81WfMTsVSKS._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81OX4HmL1EL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/81fm73Zi1kL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Nayeem Hossain", "rating": 5, "comment": "Very cozy and stylish. Perfect for winter."},
      {"user": "Aminul Islam", "rating": 4, "comment": "Warm and comfortable. Fits nicely."},
      {"user": "Rahat Khan", "rating": 5, "comment": "Great quality flannel. Love the checked pattern."},
      {"user": "Fahim Shah", "rating": 4, "comment": "Good winter shirt but a bit thick for mild weather."}
    ],
    "tags": ["men", "shirt", "flannel", "winter", "checked"],
    "createdAt": "2025-09-11T10:20:00Z",
    "updatedAt": "2025-09-11T10:20:00Z"
  },
  {
    "title": "Formal Solid Office Shirt",
    "description": "Elevate your office wardrobe with this Formal Solid Office Shirt, designed for men who prefer simplicity and elegance. Made from a high-quality cotton blend, this shirt offers a soft touch, breathability, and a crisp look that stays sharp throughout the day. Its solid color design provides a versatile option for pairing with suits, blazers, or dress pants. The button-down collar, adjustable cuffs, and neat stitching give a polished, professional appearance. Designed for comfort and easy maintenance, it retains shape and color even after repeated washing. Ideal for office meetings, presentations, or formal events, this shirt seamlessly combines style with practicality. Available in classic colors like white, light blue, and grey, it is a wardrobe essential for men seeking a refined and timeless look. The lightweight yet durable fabric ensures comfort during long working hours while maintaining a sharp, confident presence.",
    "price": 3100,
    "discountPrice": 2599,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "ProAttire",
    "rating": 4.8,
    "stock": 18,
    "featured": false,
    "sizes": ["M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/610Gc7CNzzL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71B5SQs0aNL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/612yADzgXiL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Shahriar Khan", "rating": 5, "comment": "Perfect formal shirt. Soft and comfortable."},
      {"user": "Arif Ahmed", "rating": 5, "comment": "Classic design and great fit. Excellent quality."},
      {"user": "Jahid Hossain", "rating": 4, "comment": "Nice fabric, very breathable."},
      {"user": "Rafiq Alam", "rating": 4, "comment": "Looks formal and professional. Highly recommend."}
    ],
    "tags": ["men", "shirt", "formal", "solid", "office"],
    "createdAt": "2025-09-11T10:25:00Z",
    "updatedAt": "2025-09-11T10:25:00Z"
  },
  {
    "title": "Denim Western Casual Shirt",
    "description": "Make a statement with this Denim Western Casual Shirt, combining rugged charm with modern style. Made from high-quality soft denim, it offers durability, comfort, and a slightly worn-in look for a contemporary aesthetic. Designed with snap buttons, dual chest pockets, and a pointed collar, it provides a western-inspired appearance perfect for casual outings or semi-formal events. The shirt’s relaxed fit ensures freedom of movement while maintaining a structured look. Its versatility allows pairing with jeans, chinos, or casual trousers, creating multiple outfit options. Durable stitching and premium denim ensure long-lasting wear, while the natural fading and texture give each shirt a unique character. Perfect for weekends, parties, or casual gatherings, this denim shirt elevates your wardrobe with a balance of ruggedness and sophistication. Easy to maintain and stylish, it is ideal for men who appreciate quality casual wear with an edge.",
    "price": 2900,
    "discountPrice": 2399,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "WesternX",
    "rating": 4.6,
    "stock": 22,
    "featured": true,
    "sizes": ["S", "M", "L", "XL"],
    "images": ["https://m.media-amazon.com/images/I/81WvX719FTL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/81+s7CzgHgL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/81yCwyVKOPL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Fahad Hossain", "rating": 5, "comment": "Stylish and comfortable. Looks great on casual outings."},
      {"user": "Tanvir Rahman", "rating": 4, "comment": "Good fit and quality denim."},
      {"user": "Rashed Alam", "rating": 5, "comment": "Western style is perfect. Very satisfied."},
      {"user": "Monir Khan", "rating": 4, "comment": "Nice denim texture and design."}
    ],
    "tags": ["men", "shirt", "denim", "western", "casual"],
    "createdAt": "2025-09-11T10:30:00Z",
    "updatedAt": "2025-09-11T10:30:00Z"
  },
  {
    "title": "Short Sleeve Printed Casual Shirt",
    "description": "Add a pop of style to your casual wardrobe with this Short Sleeve Printed Casual Shirt. Crafted from lightweight cotton, it offers breathability and comfort, perfect for summer outings, vacations, or weekend gatherings. The vibrant prints and patterns make it stand out, adding a fun and youthful vibe to your look. Designed with a classic collar, button-front closure, and short sleeves, it allows ease of movement while keeping you stylish and relaxed. The soft fabric ensures comfort even in hot weather, and its durable stitching maintains the shirt's shape over time. Perfect to pair with shorts, chinos, or casual trousers, this shirt elevates casual ensembles effortlessly. Ideal for men who want to express their personality through fashion, it balances comfort, style, and versatility. Easy to wear, maintain, and mix with various outfits, this printed shirt becomes a must-have for casual summer wardrobes.",
    "price": 2600,
    "discountPrice": 2099,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "PrintStyle",
    "rating": 4.5,
    "stock": 28,
    "featured": false,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/61Ves0tRhZL._AC_SY879_.jpg", "https://m.media-amazon.com/images/I/81KkoRsjfML._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/81ICYSPbWHL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Shuvo Rahman", "rating": 5, "comment": "Lightweight and comfortable. Love the print."},
      {"user": "Irfan Khan", "rating": 4, "comment": "Good casual shirt for weekends."},
      {"user": "Rahat Hossain", "rating": 5, "comment": "Vibrant colors and nice fit."},
      {"user": "Nazmul Alam", "rating": 4, "comment": "Comfortable and stylish. Worth buying."}
    ],
    "tags": ["men", "shirt", "printed", "casual", "summer"],
    "createdAt": "2025-09-11T10:35:00Z",
    "updatedAt": "2025-09-11T10:35:00Z"
  },
  {
    "title": "Oxford Button-Down Classic Shirt",
    "description": "Upgrade your wardrobe with the Oxford Button-Down Classic Shirt, a timeless piece designed for men who appreciate elegance and simplicity. Made from premium cotton, this shirt ensures a soft touch, breathability, and a crisp appearance that lasts all day. The button-down collar adds a sophisticated flair, while the tailored fit enhances your silhouette without compromising comfort. Ideal for formal meetings, casual Fridays, or social gatherings, it can be paired with dress pants, chinos, or even jeans for a versatile look. Durable stitching and high-quality fabric maintain its premium feel after multiple washes. Available in classic shades like white, blue, and light grey, this Oxford shirt becomes a versatile staple in any man’s wardrobe. Its understated elegance makes it suitable for layering under blazers or wearing alone, combining timeless design with practical comfort. Perfect for men seeking a refined yet effortless look for everyday and special occasions.",
    "price": 3300,
    "discountPrice": 2799,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shirt",
    "brand": "ClassicWear",
    "rating": 4.8,
    "stock": 16,
    "featured": true,
    "sizes": ["M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/61Ps6-bpNSL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/71H5036hgSL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/81AkeX-WlnL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Arif Hossain", "rating": 5, "comment": "High-quality Oxford shirt. Perfect for office and casual use."},
      {"user": "Shahriar Alam", "rating": 5, "comment": "Comfortable and classy. Fits very well."},
      {"user": "Tanvir Khan", "rating": 4, "comment": "Excellent shirt but slightly pricey."},
      {"user": "Rafiq Hossain", "rating": 5, "comment": "Timeless design. Worth every penny."}
    ],
    "tags": ["men", "shirt", "oxford", "classic", "button-down"],
    "createdAt": "2025-09-11T10:40:00Z",
    "updatedAt": "2025-09-11T10:40:00Z"
  },

  
  {
    "title": "Slim Fit Casual Chinos",
    "description": "Elevate your casual wardrobe with these Slim Fit Casual Chinos, designed for men who value both comfort and style. Made from a high-quality cotton blend, these pants offer breathability, softness, and durability for daily wear. The slim fit provides a modern silhouette, while the mid-rise waist ensures a comfortable fit throughout the day. Featuring functional side pockets and back welt pockets, they combine practicality with aesthetic appeal. Ideal for pairing with shirts, t-shirts, or polos, these chinos can easily transition from office meetings to weekend outings. The fabric is lightweight and easy to maintain, retaining its shape and color after multiple washes. Available in a variety of classic colors such as khaki, navy, and grey, these pants offer versatility and timeless style. Their tailored design ensures a polished appearance without sacrificing comfort, making them a must-have for the modern man’s wardrobe. Perfect for casual events, semi-formal settings, or relaxed office environments, these chinos are a staple piece for effortless style.",
    "price": 3200,
    "discountPrice": 2699,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Pant",
    "brand": "UrbanTrend",
    "rating": 4.7,
    "stock": 25,
    "featured": true,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/718nMRdwXJL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71IHHsT3VnL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71o3Fh4x5+L._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Arif Hossain", "rating": 5, "comment": "Perfect fit and comfortable for long hours."},
      {"user": "Rashed Khan", "rating": 4, "comment": "Nice quality. Looks stylish with shirts."},
      {"user": "Jahid Islam", "rating": 5, "comment": "Good fabric and stitching. Very durable."},
      {"user": "Imran Ali", "rating": 4, "comment": "Color is as shown. Slim fit is perfect."}
    ],
    "tags": ["men", "pant", "chinos", "casual", "slim fit"],
    "createdAt": "2025-09-11T11:00:00Z",
    "updatedAt": "2025-09-11T11:00:00Z"
  },
  {
    "title": "Formal Office Trousers",
    "description": "Upgrade your professional wardrobe with these Formal Office Trousers, crafted for men seeking a polished and sophisticated look. Made from a premium polyester-cotton blend, these trousers are wrinkle-resistant and maintain a crisp appearance throughout the day. The mid-rise waist and tailored slim fit create a modern silhouette while ensuring comfort. Featuring belt loops, side pockets, and back welt pockets, these trousers combine functionality with elegance. Ideal for pairing with dress shirts, blazers, or formal shoes, they are perfect for office meetings, presentations, or formal events. The durable fabric allows repeated wear and washing without losing shape or color. Available in classic shades like black, navy, and grey, these trousers are versatile staples that fit seamlessly into any professional wardrobe. Designed to offer both style and comfort, they are a must-have for men who prioritize a sharp and refined appearance for daily workwear.",
    "price": 3800,
    "discountPrice": 3299,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Pant",
    "brand": "ExecutiveWear",
    "rating": 4.8,
    "stock": 20,
    "featured": true,
    "sizes": ["M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/516Mh2RneyL._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/61GhTOz9PCL._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/51yqE-QaJWL._AC_SY741_.jpg"],
    "reviews": [
      {"user": "Fahim Rahman", "rating": 5, "comment": "Excellent formal trousers. Very comfortable."},
      {"user": "Tanvir Ahmed", "rating": 5, "comment": "Perfect for office wear. Looks classy."},
      {"user": "Sabbir Hossain", "rating": 4, "comment": "Nice fabric but slightly tight at waist."},
      {"user": "Rakib Khan", "rating": 5, "comment": "Great quality. Worth buying."}
    ],
    "tags": ["men", "pant", "formal", "office", "trousers"],
    "createdAt": "2025-09-11T11:05:00Z",
    "updatedAt": "2025-09-11T11:05:00Z"
  },
  {
    "title": "Denim Slim Fit Jeans",
    "description": "Upgrade your casual collection with these Denim Slim Fit Jeans, crafted from premium stretchable denim for ultimate comfort and style. The slim fit enhances the modern silhouette, while the mid-rise waist ensures a secure and comfortable fit. Featuring classic five-pocket styling, reinforced stitching, and a zip fly with button closure, these jeans combine practicality with timeless fashion. Perfect for pairing with casual shirts, t-shirts, or jackets, they are ideal for outings, parties, or weekend getaways. The denim fabric is durable, retains its color after multiple washes, and develops a unique character with wear. Available in dark blue, black, and light washes, these jeans offer versatility for creating a variety of looks. Their tailored fit ensures that you look polished while remaining comfortable, making them a wardrobe essential for the modern man seeking casual yet stylish denim pants.",
    "price": 3500,
    "discountPrice": 2999,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Pant",
    "brand": "DenimX",
    "rating": 4.6,
    "stock": 30,
    "featured": true,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/71H2hdsENOL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/91JdUWojVkS._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/91J6zdbunDL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Shahriar Alam", "rating": 5, "comment": "Stylish jeans and very comfortable."},
      {"user": "Nazmul Hossain", "rating": 4, "comment": "Good fit and nice denim color."},
      {"user": "Arman Khan", "rating": 5, "comment": "Durable and looks premium."},
      {"user": "Fahad Islam", "rating": 4, "comment": "Slim fit is perfect. Material feels strong."}
    ],
    "tags": ["men", "pant", "denim", "jeans", "slim fit"],
    "createdAt": "2025-09-11T11:10:00Z",
    "updatedAt": "2025-09-11T11:10:00Z"
  },
  {
    "title": "Casual Jogger Pants",
    "description": "Experience ultimate comfort and style with these Casual Jogger Pants, designed for men who want a relaxed yet modern look. Made from a soft cotton-polyester blend, they offer breathability, stretch, and durability for everyday wear. The elastic waistband with drawstring provides a customizable fit, while cuffed ankles give a trendy and sporty silhouette. Equipped with side pockets and a back pocket, these joggers are both practical and stylish. Perfect for lounging, casual outings, or workouts, they pair effortlessly with t-shirts, hoodies, or sweatshirts. The fabric is easy to maintain and retains color and shape after repeated washes. Available in classic colors like black, grey, and navy, these jogger pants are a versatile addition to any man’s wardrobe. Comfortable, functional, and stylish, they are ideal for men seeking casual pants that combine fashion with practicality.",
    "price": 2800,
    "discountPrice": 2299,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Pant",
    "brand": "UrbanActive",
    "rating": 4.5,
    "stock": 35,
    "featured": false,
    "sizes": ["S", "M", "L", "XL"],
    "images": ["https://m.media-amazon.com/images/I/617Uv-Sg21L._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/711VISn5fYL._AC_SY550_.jpg", "https://m.media-amazon.com/images/I/61us2EZJMuL._AC_SY550_.jpg"],
    "reviews": [
      {"user": "Irfan Hossain", "rating": 5, "comment": "Super comfy and perfect for casual wear."},
      {"user": "Shuvo Alam", "rating": 4, "comment": "Nice material and great fit."},
      {"user": "Rafiq Khan", "rating": 5, "comment": "Good for lounging or light workouts."},
      {"user": "Monir Hossain", "rating": 4, "comment": "Soft and breathable. Very happy with the purchase."}
    ],
    "tags": ["men", "pant", "jogger", "casual", "sporty"],
    "createdAt": "2025-09-11T11:15:00Z",
    "updatedAt": "2025-09-11T11:15:00Z"
  },
  {
    "title": "Linen Summer Trousers",
    "description": "Stay cool and stylish during warm weather with these Linen Summer Trousers, crafted for men seeking comfort and elegance. Made from 100% lightweight linen, these pants are breathable, soft, and perfect for hot climates. The relaxed fit and straight-leg design provide ease of movement, while the mid-rise waist ensures a comfortable fit. Featuring side pockets and back welt pockets, these trousers combine functionality with effortless style. Ideal for beach outings, casual brunches, or summer vacations, they can be paired with shirts, polos, or t-shirts for a relaxed yet refined look. The natural linen texture adds a sophisticated charm and keeps you cool throughout the day. Available in pastel shades and neutral colors, these trousers offer versatility for creating multiple summer outfits. Durable and easy to maintain, they retain shape and color even after multiple washes. These linen trousers are a perfect blend of style, comfort, and summer practicality for modern men.",
    "price": 3000,
    "discountPrice": 2499,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Pant",
    "brand": "SunStyle",
    "rating": 4.6,
    "stock": 18,
    "featured": true,
    "sizes": ["M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/61Rlm1PC27L._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/61RaDCsSKQL._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/5198lwVX-+L._AC_SY741_.jpg"],
    "reviews": [
      {"user": "Irfan Hossain", "rating": 5, "comment": "Very light and comfortable. Perfect for summer."},
      {"user": "Shuvo Alam", "rating": 4, "comment": "Feels premium and keeps me cool."},
      {"user": "Rafiq Khan", "rating": 5, "comment": "Great fabric and design."},
      {"user": "Monir Hossain", "rating": 4, "comment": "Nice linen trousers. Easy to wear and maintain."}
    ],
    "tags": ["men", "pant", "linen", "summer", "casual"],
    "createdAt": "2025-09-11T11:20:00Z",
    "updatedAt": "2025-09-11T11:20:00Z"
  },
  {
    "title": "Winter Corduroy Pants",
    "description": "Keep warm and stylish with these Winter Corduroy Pants, designed for men who want comfort and sophistication during colder months. Made from soft, thick corduroy fabric, these pants provide insulation while maintaining a refined look. The tailored straight-leg fit enhances your silhouette, and the mid-rise waist ensures all-day comfort. Equipped with side and back pockets, these pants combine practicality with style. Ideal for casual outings, office wear, or semi-formal gatherings during winter, they pair well with sweaters, shirts, or jackets. The durable corduroy fabric retains color and texture even after repeated washing, ensuring long-lasting use. Available in classic winter shades like brown, navy, and grey, these pants are versatile and timeless. With a perfect balance of warmth, comfort, and style, these corduroy pants are a winter wardrobe essential for men who value fashion and functionality.",
    "price": 3400,
    "discountPrice": 2899,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Pant",
    "brand": "WinterWear",
    "rating": 4.7,
    "stock": 15,
    "featured": true,
    "sizes": ["M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/61a0oFtfekL._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/61LKnYR8iLL._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/71X-90xDWQL._AC_SY741_.jpg"],
    "reviews": [
      {"user": "Nayeem Hossain", "rating": 5, "comment": "Very warm and stylish. Perfect for winter."},
      {"user": "Aminul Islam", "rating": 4, "comment": "Nice fabric. Fits well and comfortable."},
      {"user": "Rahat Khan", "rating": 5, "comment": "Good quality corduroy. Looks premium."},
      {"user": "Fahim Shah", "rating": 4, "comment": "A bit thick but keeps me warm. Excellent design."}
    ],
    "tags": ["men", "pant", "corduroy", "winter", "casual"],
    "createdAt": "2025-09-11T11:25:00Z",
    "updatedAt": "2025-09-11T11:25:00Z"
  },


  {
    "title": "Classic Leather Oxford Shoes",
    "description": "Step up your formal style with these Classic Leather Oxford Shoes, designed for men who value elegance and comfort. Crafted from premium genuine leather, these shoes offer durability, breathability, and a polished finish that elevates any formal outfit. The sleek lace-up design ensures a secure fit, while the cushioned insole provides all-day comfort. Perfect for office meetings, weddings, or special events, they pair seamlessly with suits, dress pants, or chinos. The sturdy rubber sole delivers excellent traction, making them practical for various surfaces. With meticulous stitching and attention to detail, these shoes exude sophistication and timeless style. Available in classic black and brown, they are versatile wardrobe staples that complement multiple outfits. Designed for longevity, they maintain their shape and shine even after repeated wear. Whether for professional or formal occasions, these Oxford shoes ensure you make a confident and stylish impression wherever you go.",
    "price": 5500,
    "discountPrice": 4799,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shoes",
    "brand": "ExecutiveWear",
    "rating": 4.8,
    "stock": 20,
    "featured": true,
    "sizes": [39, 40, 41, 42, 43, 44],
    "images": ["https://m.media-amazon.com/images/I/61h0phxqV+L._AC_SY625_.jpg", "https://m.media-amazon.com/images/I/61fA7jAEqqL._AC_SY625_.jpg", "https://m.media-amazon.com/images/I/61YWympPG2L._AC_SY625_.jpg"],
    "reviews": [
      {"user": "Arif Hossain", "rating": 5, "comment": "Very comfortable and looks premium. Great for office."},
      {"user": "Rashed Khan", "rating": 5, "comment": "Classic design. Perfect with formal suits."},
      {"user": "Jahid Islam", "rating": 4, "comment": "Good leather quality. Fits well."},
      {"user": "Imran Ali", "rating": 5, "comment": "Polished finish and very durable."}
    ],
    "tags": ["men", "shoes", "formal", "oxford", "leather"],
    "createdAt": "2025-09-11T12:00:00Z",
    "updatedAt": "2025-09-11T12:00:00Z"
  },
  {
    "title": "Casual Canvas Sneakers",
    "description": "Step into everyday comfort and style with these Casual Canvas Sneakers. Made from high-quality breathable canvas, these shoes provide lightweight comfort for long hours of wear. The lace-up design ensures a snug fit, while the padded collar and cushioned insole enhance support. Perfect for casual outings, weekend strolls, or travel, they pair effortlessly with jeans, chinos, or shorts. The durable rubber outsole delivers excellent traction and stability on various surfaces. Featuring a minimalist yet modern design, these sneakers are versatile enough to complement multiple casual outfits. Easy to clean and maintain, they retain their shape and color even after repeated wear. Available in classic shades like white, black, and navy, these sneakers are wardrobe essentials for men seeking comfort and style. With their combination of durability, versatility, and trendy design, these shoes are perfect for those who want to look stylish while staying comfortable.",
    "price": 4200,
    "discountPrice": 3699,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shoes",
    "brand": "UrbanTrend",
    "rating": 4.6,
    "stock": 30,
    "featured": true,
    "sizes": [39, 40, 41, 42, 43, 44],
    "images": ["https://m.media-amazon.com/images/I/71y6deimHdL._AC_SY695_.jpg", "https://m.media-amazon.com/images/I/61mDDdDDBCL._AC_SX575_.jpg", "https://m.media-amazon.com/images/I/71AFXVmZeLL._AC_SY575_.jpg"],
    "reviews": [
      {"user": "Shahriar Alam", "rating": 5, "comment": "Very comfortable and lightweight. Perfect for daily wear."},
      {"user": "Nazmul Hossain", "rating": 4, "comment": "Looks stylish and pairs with any casual outfit."},
      {"user": "Arman Khan", "rating": 5, "comment": "Good quality canvas. Great value."},
      {"user": "Fahad Islam", "rating": 4, "comment": "Easy to wear and very comfortable."}
    ],
    "tags": ["men", "shoes", "sneakers", "casual", "canvas"],
    "createdAt": "2025-09-11T12:05:00Z",
    "updatedAt": "2025-09-11T12:05:00Z"
  },
  {
    "title": "Sport Running Shoes",
    "description": "Enhance your athletic performance and comfort with these Sport Running Shoes. Designed with lightweight, breathable mesh upper, these shoes provide excellent ventilation and flexibility for running or workouts. The cushioned midsole ensures shock absorption and all-day comfort, while the durable rubber outsole provides superior grip and traction on multiple surfaces. Perfect for jogging, gym sessions, or outdoor activities, these shoes support natural movement and reduce fatigue. The lace-up closure allows for a customizable fit, while the stylish design makes them versatile enough for casual wear as well. Available in modern color combinations, they combine performance with trendy aesthetics. Built to endure intense physical activities, these running shoes maintain shape, comfort, and durability over time. Ideal for men who are active and prioritize both functionality and style in their footwear, these shoes deliver the perfect balance of support, agility, and sporty fashion.",
    "price": 4800,
    "discountPrice": 4299,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shoes",
    "brand": "ActiveX",
    "rating": 4.7,
    "stock": 25,
    "featured": true,
    "sizes": [39, 40, 41, 42, 43, 44],
    "images": ["https://m.media-amazon.com/images/I/414egjgn-uL._AC_SY575_.jpg", "https://m.media-amazon.com/images/I/61BsmaqqTIL._AC_SY575_.jpg", "https://m.media-amazon.com/images/I/51iD9iepCvL._AC_SY575_.jpg"],
    "reviews": [
      {"user": "Irfan Hossain", "rating": 5, "comment": "Very comfortable and supportive for running."},
      {"user": "Shuvo Alam", "rating": 4, "comment": "Lightweight and stylish. Perfect for gym."},
      {"user": "Rafiq Khan", "rating": 5, "comment": "Excellent grip and cushioning."},
      {"user": "Monir Hossain", "rating": 4, "comment": "Great running shoes. Feels premium."}
    ],
    "tags": ["men", "shoes", "running", "sport", "athletic"],
    "createdAt": "2025-09-11T12:10:00Z",
    "updatedAt": "2025-09-11T12:10:00Z"
  },
  {
    "title": "Leather Casual Loafers",
    "description": "Step out in effortless style with these Leather Casual Loafers, crafted for men who value comfort and sophistication. Made from premium genuine leather, these slip-on shoes provide a soft touch, durability, and a polished finish. Featuring a cushioned insole and flexible sole, they ensure all-day comfort, while the classic design pairs perfectly with chinos, jeans, or shorts. Ideal for casual outings, social gatherings, or semi-formal events, they offer both practicality and elegance. The durable rubber outsole provides reliable grip and longevity. Available in brown and black shades, these loafers are versatile and timeless, making them suitable for multiple occasions. Easy to wear and maintain, they retain their shape and shine over time. Perfect for men who want a stylish, comfortable, and versatile footwear option, these casual leather loafers are a must-have in any modern wardrobe.",
    "price": 5000,
    "discountPrice": 4499,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shoes",
    "brand": "UrbanStyle",
    "rating": 4.7,
    "stock": 22,
    "featured": true,
    "sizes": [39, 40, 41, 42, 43, 44],
    "images": ["https://m.media-amazon.com/images/I/81d4O2ozqDL._AC_SX695_.jpg", "https://m.media-amazon.com/images/I/71s6xP6pfVL._AC_SX575_.jpg", "https://m.media-amazon.com/images/I/61XViYesP+L._AC_SY575_.jpg"],
    "reviews": [
      {"user": "Nayeem Hossain", "rating": 5, "comment": "Very comfortable and stylish loafers. Perfect for casual wear."},
      {"user": "Aminul Islam", "rating": 4, "comment": "High-quality leather. Looks classy."},
      {"user": "Rahat Khan", "rating": 5, "comment": "Easy to slip on. Feels premium."},
      {"user": "Fahim Shah", "rating": 4, "comment": "Nice casual shoes. Durable and comfy."}
    ],
    "tags": ["men", "shoes", "loafers", "casual", "leather"],
    "createdAt": "2025-09-11T12:15:00Z",
    "updatedAt": "2025-09-11T12:15:00Z"
  },
  {
    "title": "High-Top Casual Sneakers",
    "description": "Make a bold statement with these High-Top Casual Sneakers, designed for men who love a mix of style and comfort. Made from premium canvas and synthetic materials, they provide durability, breathability, and flexibility for daily wear. The lace-up design ensures a secure fit, while the cushioned insole delivers comfort for long hours. Perfect for casual outings, streetwear looks, or weekend activities, these sneakers pair effortlessly with jeans, joggers, or shorts. The sturdy rubber outsole ensures excellent grip and longevity. With their contemporary high-top design and vibrant color options, these sneakers are trendy and versatile. Easy to maintain and wear, they retain their shape and look even after repeated use. Ideal for men who want a fashionable and comfortable footwear option, these high-top sneakers combine urban style with practical comfort for modern casual wear.",
    "price": 4600,
    "discountPrice": 4099,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "Shoes",
    "brand": "StreetX",
    "rating": 4.6,
    "stock": 28,
    "featured": true,
    "sizes": [39, 40, 41, 42, 43, 44],
    "images": ["https://m.media-amazon.com/images/I/710EriNYAnL._AC_SY575_.jpg", "https://m.media-amazon.com/images/I/71Ky41T29qL._AC_SX575_.jpg", "https://m.media-amazon.com/images/I/81hKItENs6L._AC_SY575_.jpg"],
    "reviews": [
      {"user": "Shuvo Rahman", "rating": 5, "comment": "Stylish high-tops and very comfortable."},
      {"user": "Irfan Khan", "rating": 4, "comment": "Good fit and trendy design."},
      {"user": "Rahat Hossain", "rating": 5, "comment": "Perfect for casual outings and streetwear."},
      {"user": "Nazmul Alam", "rating": 4, "comment": "Lightweight and durable. Nice sneakers."}
    ],
    "tags": ["men", "shoes", "sneakers", "high-top", "casual"],
    "createdAt": "2025-09-11T12:20:00Z",
    "updatedAt": "2025-09-11T12:20:00Z"
  },


  {
    "title": "Classic Cotton Crew Neck T-Shirt",
    "description": "Upgrade your everyday wardrobe with this Classic Cotton Crew Neck T-Shirt, designed for men who value comfort and timeless style. Crafted from 100% premium cotton, this T-shirt offers exceptional softness, breathability, and durability for all-day wear. Its crew neck design ensures a versatile and flattering fit for various body types. Perfect for casual outings, workouts, or layering under jackets and hoodies, it combines simplicity with functionality. The fabric is pre-shrunk, retaining its shape and vibrant color after multiple washes. Available in a variety of classic shades including white, black, grey, and navy, this T-shirt easily complements any outfit. The relaxed yet tailored fit provides comfort without appearing baggy, making it ideal for everyday use. Designed with meticulous stitching and high-quality materials, this T-shirt offers long-lasting wear and a polished look. Whether paired with jeans, shorts, or chinos, it remains a staple for effortless casual style and modern men’s fashion.",
    "price": 1200,
    "discountPrice": 999,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "T-shirt",
    "brand": "UrbanTrend",
    "rating": 4.7,
    "stock": 50,
    "featured": true,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/81C7JKKgtcL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71E8XQmbNZL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71HXW9X9skL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Arif Hossain", "rating": 5, "comment": "Soft and comfortable, perfect for daily wear."},
      {"user": "Rashed Khan", "rating": 4, "comment": "Good quality cotton, fits well."},
      {"user": "Jahid Islam", "rating": 5, "comment": "Retains shape after wash. Highly recommend."},
      {"user": "Imran Ali", "rating": 5, "comment": "Versatile and stylish T-shirt for casual outings."}
    ],
    "tags": ["men", "t-shirt", "cotton", "casual", "crew neck"],
    "createdAt": "2025-09-11T13:00:00Z",
    "updatedAt": "2025-09-11T13:00:00Z"
  },
  {
    "title": "V-Neck Slim Fit T-Shirt",
    "description": "Achieve a modern and stylish look with this V-Neck Slim Fit T-Shirt, crafted for men who want a flattering fit without compromising comfort. Made from a high-quality cotton-polyester blend, this T-shirt offers stretch, softness, and durability for all-day wear. The V-neck design adds a contemporary touch and pairs well with jeans, chinos, or layered under jackets. Its slim fit contours to the body, providing a clean and streamlined appearance suitable for casual and semi-casual occasions. Available in multiple colors like black, navy, grey, and olive, this T-shirt adds versatility to your wardrobe. Easy to care for and resistant to shrinkage, it maintains its shape and vibrant color after repeated washes. Ideal for men who prefer minimalistic style with maximum comfort, this T-shirt combines functionality with modern fashion trends. Its meticulous stitching and premium fabric ensure longevity and a polished look every time you wear it.",
    "price": 1300,
    "discountPrice": 1099,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "T-shirt",
    "brand": "StylePoint",
    "rating": 4.6,
    "stock": 40,
    "featured": true,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/717jv8ZUhkL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81zBhqaVJbL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81wEc8LtkTL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Shahriar Alam", "rating": 5, "comment": "Slim fit is perfect. Comfortable and stylish."},
      {"user": "Nazmul Hossain", "rating": 4, "comment": "Good quality fabric, feels soft."},
      {"user": "Arman Khan", "rating": 5, "comment": "V-neck design looks trendy and modern."},
      {"user": "Fahad Islam", "rating": 4, "comment": "Fits nicely and looks premium."}
    ],
    "tags": ["men", "t-shirt", "v-neck", "slim fit", "casual"],
    "createdAt": "2025-09-11T13:05:00Z",
    "updatedAt": "2025-09-11T13:05:00Z"
  },
  {
    "title": "Graphic Printed T-Shirt",
    "description": "Make a bold statement with this Graphic Printed T-Shirt, designed for men who love to showcase personality through style. Made from 100% soft cotton, it provides comfort, breathability, and durability for everyday wear. Featuring high-quality printed graphics, this T-shirt adds a creative and trendy touch to casual outfits. The classic crew neck and regular fit ensure versatility and ease of movement, making it suitable for casual outings, parties, or layered styling. Available in multiple colors with unique graphic designs, this T-shirt complements jeans, shorts, or chinos effortlessly. The fabric is pre-shrunk, maintaining its shape and print vibrancy even after multiple washes. Designed with precision stitching and premium cotton, it offers long-lasting wear and an eye-catching look. Ideal for men who enjoy casual fashion with a creative edge, this graphic T-shirt blends comfort, style, and individuality in one wardrobe essential.",
    "price": 1500,
    "discountPrice": 1299,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "T-shirt",
    "brand": "UrbanEdge",
    "rating": 4.5,
    "stock": 35,
    "featured": true,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/61mEU5sfVOL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/61G0iowKv7L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/6112fGGkuXL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Irfan Hossain", "rating": 5, "comment": "Graphic print is bold and stylish. Fits well."},
      {"user": "Shuvo Alam", "rating": 4, "comment": "Soft cotton and trendy design."},
      {"user": "Rafiq Khan", "rating": 5, "comment": "Looks premium and comfortable."},
      {"user": "Monir Hossain", "rating": 4, "comment": "Great T-shirt for casual outings."}
    ],
    "tags": ["men", "t-shirt", "graphic", "cotton", "casual"],
    "createdAt": "2025-09-11T13:10:00Z",
    "updatedAt": "2025-09-11T13:10:00Z"
  },
  {
    "title": "Striped Casual T-Shirt",
    "description": "Add a touch of pattern to your casual wardrobe with this Striped Casual T-Shirt, crafted for men who love classic yet stylish designs. Made from soft, breathable cotton, this T-shirt ensures comfort and durability throughout the day. The regular fit provides a relaxed silhouette, while the horizontal stripes add visual appeal and versatility. Perfect for casual outings, weekend brunches, or layered styling, it pairs seamlessly with jeans, chinos, or shorts. The crew neck design and high-quality stitching maintain shape and fit after repeated washes. Available in multiple color combinations, this striped T-shirt is a versatile addition to any wardrobe. Ideal for men who appreciate simple patterns with maximum comfort, it combines casual style with practicality. Its soft cotton fabric, lasting quality, and stylish design make it a reliable go-to piece for modern casual fashion.",
    "price": 1400,
    "discountPrice": 1199,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "T-shirt",
    "brand": "ClassicWear",
    "rating": 4.6,
    "stock": 45,
    "featured": true,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/81Fstxm7zBL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81sd8wNa8JL._AC_SX569_.jpg", "https://m.media-amazon.com/images/I/81FHR329KdL._AC_SX569_.jpg"],
    "reviews": [
      {"user": "Arif Hossain", "rating": 5, "comment": "Soft, breathable, and fits perfectly."},
      {"user": "Rashed Khan", "rating": 4, "comment": "Looks stylish with jeans and shorts."},
      {"user": "Jahid Islam", "rating": 5, "comment": "Quality fabric and nice pattern."},
      {"user": "Imran Ali", "rating": 4, "comment": "Striped design is classic and versatile."}
    ],
    "tags": ["men", "t-shirt", "striped", "casual", "cotton"],
    "createdAt": "2025-09-11T13:15:00Z",
    "updatedAt": "2025-09-11T13:15:00Z"
  },
  {
    "title": "Long Sleeve Henley T-Shirt",
    "description": "Stay comfortable and stylish with this Long Sleeve Henley T-Shirt, designed for men who appreciate versatile casual wear. Made from a soft cotton-polyester blend, it provides comfort, stretch, and durability for daily wear. Featuring a classic Henley button placket and long sleeves, this T-shirt adds sophistication to casual outfits. Perfect for layering under jackets, sweaters, or wearing alone, it pairs well with jeans, chinos, or joggers. The regular fit ensures ease of movement without appearing baggy. Available in neutral shades like grey, black, navy, and olive, this Henley T-shirt is versatile for multiple occasions. The high-quality stitching and pre-shrunk fabric maintain shape and color after repeated washes. Ideal for men seeking a blend of style, comfort, and functionality, this long sleeve Henley T-shirt is a modern essential for casual and semi-casual wardrobes, offering effortless fashion with a timeless appeal.",
    "price": 1600,
    "discountPrice": 1399,
    "currency": "BDT",
    "category": "Men Fashion",
    "subCategory": "T-shirt",
    "brand": "UrbanStyle",
    "rating": 4.7,
    "stock": 40,
    "featured": true,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "images": ["https://m.media-amazon.com/images/I/71+5iPCx8tS._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81aU1Un7t7S._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/8156q9SOZJS._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Shahriar Alam", "rating": 5, "comment": "Henley style looks great. Very comfortable."},
      {"user": "Nazmul Hossain", "rating": 4, "comment": "Soft and durable fabric. Perfect for layering."},
      {"user": "Arman Khan", "rating": 5, "comment": "Fits well and looks stylish."},
      {"user": "Fahad Islam", "rating": 4, "comment": "Versatile T-shirt. Good for casual and semi-casual."}
    ],
    "tags": ["men", "t-shirt", "henley", "long sleeve", "casual"],
    "createdAt": "2025-09-11T13:20:00Z",
    "updatedAt": "2025-09-11T13:20:00Z"
  },

  
  {
    "title": "Samsung Galaxy S23 Ultra",
    "description": "Experience cutting-edge mobile technology with the Samsung Galaxy S23 Ultra. Featuring a stunning 6.8-inch Dynamic AMOLED display, this smartphone delivers vibrant colors and exceptional clarity for gaming, streaming, and everyday tasks. Powered by the latest Snapdragon 8 Gen 2 processor, it offers lightning-fast performance, seamless multitasking, and energy efficiency. The quad-camera system includes a 200MP main sensor, ultra-wide lens, and dual telephoto lenses, capturing professional-quality photos and videos in any lighting. With a massive 5000mAh battery and 45W fast charging, stay connected all day without worrying about running out of power. The device supports 5G connectivity, Wi-Fi 6E, and Bluetooth 5.3, ensuring fast and stable communication. Available in Phantom Black, Cream, and Green, the Galaxy S23 Ultra combines style, power, and innovation in one sleek design. Ideal for professionals, gamers, and photography enthusiasts who demand high performance and cutting-edge features in a premium smartphone.",
    "price": 145000,
    "discountPrice": 139999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Mobile",
    "brand": "Samsung",
    "rating": 4.9,
    "stock": 15,
    "featured": true,
    "colors": ["Phantom Black", "Cream", "Green"],
    "storageOptions": ["256GB", "512GB", "1TB"],
    "images": ["https://m.media-amazon.com/images/I/513vXUcPFrL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/51ktNBsMObL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/41QNlsBfCLL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Tanvir Hossain", "rating": 5, "comment": "Absolutely stunning display and camera performance."},
      {"user": "Nayeem Islam", "rating": 5, "comment": "Battery lasts all day even with heavy usage."},
      {"user": "Rifat Khan", "rating": 4, "comment": "Fast, smooth, and premium feel. Worth every penny."},
      {"user": "Shuvo Alam", "rating": 5, "comment": "The camera quality is mind-blowing!"}
    ],
    "tags": ["mobile", "smartphone", "Samsung", "Galaxy", "Android"],
    "createdAt": "2025-09-11T14:00:00Z",
    "updatedAt": "2025-09-11T14:00:00Z"
  },
  {
    "title": "iPhone 15 Pro Max",
    "description": "Discover the power of Apple with the iPhone 15 Pro Max, designed for those who demand top-tier performance and premium design. Featuring a 6.7-inch Super Retina XDR display, it delivers true-to-life colors and exceptional brightness for immersive viewing. Powered by the A17 Bionic chip, enjoy smooth multitasking, gaming, and app performance. The triple-camera system with 48MP main sensor and enhanced night mode captures professional-grade photos and videos. With up to 1TB storage, store all your important files, photos, and videos effortlessly. The iPhone 15 Pro Max offers long-lasting battery life, MagSafe support, and iOS 18 features for seamless integration with Apple services. Available in Titanium Silver, Graphite, and Blue, it combines elegance with cutting-edge technology. Perfect for users who want the best performance, advanced photography, and a sleek premium smartphone experience in one device.",
    "price": 200000,
    "discountPrice": 189999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Mobile",
    "brand": "Apple",
    "rating": 4.9,
    "stock": 10,
    "featured": true,
    "colors": ["Titanium Silver", "Graphite", "Blue"],
    "storageOptions": ["256GB", "512GB", "1TB"],
    "images": ["https://m.media-amazon.com/images/I/61SN++CL07L._AC_SX522_.jpg", "https://m.media-amazon.com/images/I/61rDLIISfiL._AC_SX522_.jpg", "https://m.media-amazon.com/images/I/41oxP1+COkL._AC_.jpg"],
    "reviews": [
      {"user": "Arif Hossain", "rating": 5, "comment": "Premium design, super fast, and incredible camera."},
      {"user": "Rashed Khan", "rating": 5, "comment": "Smooth iOS experience, worth the price."},
      {"user": "Jahid Islam", "rating": 5, "comment": "Battery life is excellent and lasts all day."},
      {"user": "Imran Ali", "rating": 4, "comment": "A perfect blend of design and technology."}
    ],
    "tags": ["mobile", "smartphone", "iPhone", "Apple", "iOS"],
    "createdAt": "2025-09-11T14:05:00Z",
    "updatedAt": "2025-09-11T14:05:00Z"
  },
  {
    "title": "OnePlus 12 Pro",
    "description": "Experience seamless performance with the OnePlus 12 Pro, featuring a 6.7-inch Fluid AMOLED display with 120Hz refresh rate for ultra-smooth visuals. Powered by the Snapdragon 8 Gen 2 processor and 12GB RAM, enjoy lag-free multitasking, gaming, and streaming. The triple-camera system delivers stunning photos with AI-enhanced photography, including ultra-wide and telephoto lenses. Equipped with a 5000mAh battery and 100W fast charging, stay powered throughout the day. 5G support, Wi-Fi 6, and OxygenOS ensure fast connectivity and smooth user experience. Sleek and lightweight design with premium finish makes it stylish and modern. Available in Obsidian Black, Emerald Green, and Glacier Silver, the OnePlus 12 Pro is perfect for tech enthusiasts, gamers, and professionals seeking high-performance Android smartphones with premium features and elegant design.",
    "price": 125000,
    "discountPrice": 119999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Mobile",
    "brand": "OnePlus",
    "rating": 4.8,
    "stock": 20,
    "featured": true,
    "colors": ["Obsidian Black", "Emerald Green", "Glacier Silver"],
    "storageOptions": ["256GB", "512GB"],
    "images": ["https://m.media-amazon.com/images/I/71S3uSbhlRL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/712J3MIrohL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81afhhnA-aL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Shahriar Alam", "rating": 5, "comment": "Very smooth and fast. Excellent display quality."},
      {"user": "Nazmul Hossain", "rating": 4, "comment": "Battery life is good, camera quality impressive."},
      {"user": "Arman Khan", "rating": 5, "comment": "Fast charging is amazing and lightweight design."},
      {"user": "Fahad Islam", "rating": 5, "comment": "Overall a perfect Android flagship experience."}
    ],
    "tags": ["mobile", "smartphone", "OnePlus", "Android", "flagship"],
    "createdAt": "2025-09-11T14:10:00Z",
    "updatedAt": "2025-09-11T14:10:00Z"
  },
  {
    "title": "Xiaomi 14 Pro",
    "description": "Discover innovation with the Xiaomi 14 Pro, featuring a 6.73-inch AMOLED display for vibrant visuals and immersive experience. Powered by Snapdragon 8 Gen 2 processor, it ensures seamless multitasking, gaming, and app performance. The triple rear camera system includes a 50MP main sensor with advanced night photography, ultra-wide, and telephoto lenses for professional-level photos. With 12GB RAM and up to 512GB storage, store apps, media, and files without compromise. The 5000mAh battery supports 120W fast charging, ensuring you stay powered all day. MIUI offers intuitive features, 5G support, and smooth Android experience. Available in Cosmic Black, Ceramic White, and Aurora Blue, the Xiaomi 14 Pro combines style, power, and advanced technology for those who demand top-notch performance in a smartphone.",
    "price": 115000,
    "discountPrice": 109999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Mobile",
    "brand": "Xiaomi",
    "rating": 4.7,
    "stock": 18,
    "featured": true,
    "colors": ["Cosmic Black", "Ceramic White", "Aurora Blue"],
    "storageOptions": ["256GB", "512GB"],
    "images": ["https://m.media-amazon.com/images/I/51AelgZWpaL._AC_SL1000_.jpg", "https://m.media-amazon.com/images/I/61i5fA8giBL._AC_SL1000_.jpg", "https://m.media-amazon.com/images/I/61d-24g-afL._AC_SL1000_.jpg"],
    "reviews": [
      {"user": "Tanvir Hossain", "rating": 5, "comment": "Excellent performance and camera quality."},
      {"user": "Rifat Khan", "rating": 4, "comment": "Smooth interface and good battery life."},
      {"user": "Shuvo Alam", "rating": 5, "comment": "Fast and reliable. Premium feel."},
      {"user": "Monir Hossain", "rating": 4, "comment": "Amazing display and sleek design."}
    ],
    "tags": ["mobile", "smartphone", "Xiaomi", "Android", "flagship"],
    "createdAt": "2025-09-11T14:15:00Z",
    "updatedAt": "2025-09-11T14:15:00Z"
  },
  {
    "title": "Realme GT Neo 6",
    "description": "Enjoy speed and style with the Realme GT Neo 6, featuring a 6.7-inch AMOLED display with 120Hz refresh rate for smooth visuals. Powered by MediaTek Dimensity 9200+ processor with up to 12GB RAM, it handles gaming, multitasking, and streaming effortlessly. The triple rear camera system includes a 64MP main sensor with ultra-wide and macro lenses for versatile photography. Equipped with a 5000mAh battery and 100W SuperDart fast charging, it ensures long-lasting power and minimal downtime. Realme UI offers user-friendly features, 5G connectivity, and customizable settings for optimal experience. Available in Stealth Black, Neo Green, and Racing Silver, the GT Neo 6 combines high performance, modern design, and affordability, perfect for tech enthusiasts, gamers, and everyday users seeking a feature-packed Android smartphone.",
    "price": 65000,
    "discountPrice": 59999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Mobile",
    "brand": "Realme",
    "rating": 4.6,
    "stock": 25,
    "featured": true,
    "colors": ["Stealth Black", "Neo Green", "Racing Silver"],
    "storageOptions": ["128GB", "256GB", "512GB"],
    "images": ["https://m.media-amazon.com/images/I/61eMrUCm55L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/613Iwc4Fo-L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/61i2E4Fm4aL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Shahriar Alam", "rating": 5, "comment": "Very fast, smooth and good camera."},
      {"user": "Nazmul Hossain", "rating": 4, "comment": "Excellent value for money and sleek design."},
      {"user": "Arman Khan", "rating": 5, "comment": "Fast charging is amazing. Battery lasts long."},
      {"user": "Fahad Islam", "rating": 4, "comment": "Lightweight and stylish. Perfect for gaming."}
    ],
    "tags": ["mobile", "smartphone", "Realme", "Android", "fast charging"],
    "createdAt": "2025-09-11T14:20:00Z",
    "updatedAt": "2025-09-11T14:20:00Z"
  },

  
  {
    "title": "Apple AirPods Pro 2nd Gen",
    "description": "The Apple AirPods Pro 2nd Generation redefine the wireless audio experience with unmatched sound quality and innovative features. Equipped with Adaptive Transparency and Active Noise Cancellation, they intelligently adjust to your surroundings, delivering crisp, clear audio while blocking out unwanted background noise. The redesigned H2 chip ensures low-latency performance, enhanced audio fidelity, and improved battery efficiency. With Spatial Audio and dynamic head tracking, enjoy a cinematic listening experience tailored uniquely to your ear shape. The AirPods Pro come with multiple ear tip sizes, ensuring a comfortable and secure fit for long listening sessions. The new charging case supports both MagSafe and wireless charging and features a built-in speaker and U1 chip for precise Find My tracking. Offering up to 6 hours of listening time (30 hours with the case), they’re perfect for work, travel, and fitness. Seamless integration with Apple devices makes switching between iPhone, iPad, and Mac effortless. Compact, stylish, and powerful, the AirPods Pro are the ultimate choice for audiophiles and Apple ecosystem users.",
    "price": 32000,
    "discountPrice": 28999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Gadgets",
    "brand": "Apple",
    "rating": 4.9,
    "stock": 30,
    "featured": true,
    "colors": ["White"],
    "images": ["https://m.media-amazon.com/images/I/419yjKznzbL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/318hfEb9dcL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/31DWce-YmmL._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Shahriar Hossain", "rating": 5, "comment": "Noise cancellation is the best I’ve ever experienced."},
      {"user": "Mehedi Hasan", "rating": 5, "comment": "Spatial audio makes movies and music incredible."},
      {"user": "Rony Ahmed", "rating": 4, "comment": "Battery life is solid, though could be slightly better."},
      {"user": "Fariha Islam", "rating": 5, "comment": "Perfect fit and comfort. Apple nailed it again."}
    ],
    "tags": ["airpods", "wireless", "apple", "gadgets", "audio"],
    "createdAt": "2025-09-11T15:00:00Z",
    "updatedAt": "2025-09-11T15:00:00Z"
  },
  {
    "title": "Samsung Galaxy Watch 6 Classic",
    "description": "The Samsung Galaxy Watch 6 Classic is more than just a smartwatch – it’s a health, fitness, and productivity companion. Featuring a 1.5-inch Super AMOLED display with an elegant rotating bezel, it offers crisp visuals and intuitive navigation. Powered by Wear OS and integrated with Samsung Health, it provides advanced tracking for heart rate, ECG, sleep patterns, and even body composition analysis. The watch is equipped with GPS, Bluetooth, and LTE (optional) for standalone connectivity. Its durable design with sapphire crystal and stainless steel makes it stylish yet resilient. With customizable watch faces, fitness tracking, and app support from the Google Play Store, it’s highly versatile. The Galaxy Watch 6 Classic offers up to 40 hours of battery life, and with fast charging, you’re quickly back in action. Ideal for professionals, athletes, and tech lovers, it seamlessly integrates with Android and Samsung devices, making it an essential daily gadget.",
    "price": 45000,
    "discountPrice": 41999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Gadgets",
    "brand": "Samsung",
    "rating": 4.8,
    "stock": 20,
    "featured": true,
    "colors": ["Black", "Silver"],
    "images": ["https://m.media-amazon.com/images/I/81Dm65eja8L._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61jmd1pRp+L._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/711f6KLsMaL._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Nayeem Hasan", "rating": 5, "comment": "The rotating bezel feels premium and useful."},
      {"user": "Sadman Kabir", "rating": 4, "comment": "Battery life could be longer, but features are superb."},
      {"user": "Rubel Ahmed", "rating": 5, "comment": "Perfect mix of style and functionality."},
      {"user": "Sabbir Khan", "rating": 5, "comment": "Accurate health tracking and very responsive."}
    ],
    "tags": ["smartwatch", "wearable", "Samsung", "gadgets", "fitness"],
    "createdAt": "2025-09-11T15:05:00Z",
    "updatedAt": "2025-09-11T15:05:00Z"
  },
  {
    "title": "DJI Mini 3 Pro Drone",
    "description": "The DJI Mini 3 Pro Drone is a compact powerhouse designed for aerial enthusiasts and professional creators alike. Weighing under 249g, it’s lightweight, portable, and avoids registration requirements in many regions. Equipped with a 48MP camera capable of 4K HDR video recording, it delivers stunning detail and clarity in every shot. The gimbal supports true vertical shooting, perfect for social media content. With advanced obstacle sensing in three directions and intelligent flight modes like MasterShots, FocusTrack, and Hyperlapse, capturing cinematic footage has never been easier. Offering up to 34 minutes of flight time (with standard battery) and a range of up to 12km using DJI O3 transmission, it ensures reliable performance. Despite its compact size, the Mini 3 Pro packs professional-grade features, making it a must-have gadget for travel vloggers, content creators, and drone enthusiasts who want performance and portability in one.",
    "price": 125000,
    "discountPrice": 119999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Gadgets",
    "brand": "DJI",
    "rating": 4.9,
    "stock": 10,
    "featured": true,
    "colors": ["Gray"],
    "images": ["https://m.media-amazon.com/images/I/61E1A1QprFL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61B+crJbadL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/71eyVoMtpsL._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Tanim Rahman", "rating": 5, "comment": "Camera quality is stunning. Perfect for travel videos."},
      {"user": "Mahir Chowdhury", "rating": 5, "comment": "Obstacle avoidance makes flying stress-free."},
      {"user": "Imran Hossain", "rating": 4, "comment": "Wish the flight time was a bit longer."},
      {"user": "Sharmin Jahan", "rating": 5, "comment": "Compact yet professional. Absolutely love it."}
    ],
    "tags": ["drone", "DJI", "camera", "gadgets", "aerial"],
    "createdAt": "2025-09-11T15:10:00Z",
    "updatedAt": "2025-09-11T15:10:00Z"
  },
  {
    "title": "Amazon Kindle Paperwhite 11th Gen",
    "description": "The Amazon Kindle Paperwhite 11th Generation is designed for readers who want the closest experience to physical books in digital form. Featuring a 6.8-inch glare-free E Ink display with adjustable warm light and dark mode, it ensures comfortable reading day or night. With a battery life lasting up to 10 weeks, it’s one of the most power-efficient e-readers available. The device is waterproof (IPX8), making it safe for reading by the pool, beach, or bath. Store thousands of books with its 8GB/16GB storage options, and access millions of titles through Kindle Store. Its lightweight design and thin bezels make it comfortable to hold for long reading sessions. The Kindle Paperwhite integrates seamlessly with Audible, allowing users to switch between reading and listening with Bluetooth headphones. Ideal for book lovers, students, and frequent travelers, this gadget makes carrying an entire library effortless.",
    "price": 18000,
    "discountPrice": 15999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Gadgets",
    "brand": "Amazon",
    "rating": 4.7,
    "stock": 40,
    "featured": false,
    "colors": ["Black"],
    "images": ["https://m.media-amazon.com/images/I/71biqZck9GL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81YnlrX3m6L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81ku5UfokQL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Sadia Akter", "rating": 5, "comment": "Perfect for long reading sessions, very comfortable."},
      {"user": "Tanzim Hossain", "rating": 4, "comment": "Great display but wish storage was expandable."},
      {"user": "Ruma Khatun", "rating": 5, "comment": "Battery life is fantastic, lasts for weeks."},
      {"user": "Asif Karim", "rating": 4, "comment": "Waterproof feature is a big plus."}
    ],
    "tags": ["kindle", "ereader", "Amazon", "gadgets", "books"],
    "createdAt": "2025-09-11T15:15:00Z",
    "updatedAt": "2025-09-11T15:15:00Z"
  },
  {
    "title": "Sony WH-1000XM5 Wireless Headphones",
    "description": "The Sony WH-1000XM5 Wireless Headphones offer premium sound and industry-leading noise cancellation, setting a new benchmark for audio devices. Powered by dual noise sensor technology and Sony’s Integrated Processor V1, these headphones block out distractions while delivering clear, balanced sound. The lightweight design with ultra-soft earcups ensures comfort during long listening sessions. With Adaptive Sound Control, they automatically adjust to your environment. Supporting Hi-Res Audio, LDAC, and DSEE Extreme upscaling, music sounds rich and immersive. The headphones feature 30 hours of battery life on a single charge and quick charging that delivers 3 hours of playtime in just 3 minutes. Equipped with crystal-clear call quality using four beamforming microphones and advanced AI, it’s perfect for professionals and travelers. Available in Black and Silver, the WH-1000XM5 is ideal for audiophiles seeking both style and function.",
    "price": 42000,
    "discountPrice": 38999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Gadgets",
    "brand": "Sony",
    "rating": 4.9,
    "stock": 25,
    "featured": true,
    "colors": ["Black", "Silver"],
    "images": ["https://m.media-amazon.com/images/I/411pImZSUSL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61vE4JIwNAL._AC_SY741_.jpg", "https://m.media-amazon.com/images/I/61XpTvC23mL._AC_SY741_.jpg"],
    "reviews": [
      {"user": "Rakib Hasan", "rating": 5, "comment": "Noise cancellation is unbeatable. Perfect for travel."},
      {"user": "Farhana Ahmed", "rating": 5, "comment": "Very comfortable and premium sound quality."},
      {"user": "Nusrat Jahan", "rating": 4, "comment": "Pricey but worth every penny."},
      {"user": "Milon Chowdhury", "rating": 5, "comment": "The clarity during calls is amazing."}
    ],
    "tags": ["headphones", "sony", "wireless", "gadgets", "audio"],
    "createdAt": "2025-09-11T15:20:00Z",
    "updatedAt": "2025-09-11T15:20:00Z"
  },
  {
    "title": "GoPro HERO12 Black",
    "description": "The GoPro HERO12 Black is the ultimate action camera for adventurers, athletes, and content creators. It features a powerful 27MP sensor capable of recording 5.3K video at 60fps and 4K at 120fps, delivering sharp and smooth footage. With HyperSmooth 6.0 stabilization, every shot stays steady, even in extreme conditions. The compact and rugged design is waterproof up to 10 meters without housing, making it perfect for underwater adventures. Voice control, touchscreen navigation, and quick app integration make it user-friendly. TimeWarp 3.0, Night Lapse, and HDR modes give creators more flexibility in capturing stunning visuals. The HERO12 Black supports live streaming, making it ideal for vloggers. Its long-lasting battery ensures extended shooting sessions. Whether you’re skiing, diving, or biking, the GoPro HERO12 captures every moment with professional-grade quality.",
    "price": 52000,
    "discountPrice": 49999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Gadgets",
    "brand": "GoPro",
    "rating": 4.8,
    "stock": 18,
    "featured": true,
    "colors": ["Black"],
    "images": ["https://m.media-amazon.com/images/I/71p5V8+OnfL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/71lWcn6c01L._AC_SX425_.jpg", "https://m.media-amazon.com/images/I/71HNFlNMzrL._AC_SX425_.jpg"],
    "reviews": [
      {"user": "Amit Rahman", "rating": 5, "comment": "Video quality is unmatched. Perfect for vlogs."},
      {"user": "Hasibul Islam", "rating": 4, "comment": "Battery could last a bit longer but performance is excellent."},
      {"user": "Jannat Ara", "rating": 5, "comment": "HyperSmooth stabilization is a game changer."},
      {"user": "Arif Chowdhury", "rating": 5, "comment": "Compact, tough, and super easy to use."}
    ],
    "tags": ["gopro", "action camera", "gadgets", "video", "outdoor"],
    "createdAt": "2025-09-11T15:25:00Z",
    "updatedAt": "2025-09-11T15:25:00Z"
  },
  {
    "title": "Anker PowerCore 26800 Portable Charger",
    "description": "The Anker PowerCore 26800 is a high-capacity portable charger designed for people who need reliable power on the go. With a massive 26,800mAh battery, it can charge most smartphones up to 6 times, tablets 2 times, or smaller laptops once. Equipped with three USB ports, it allows simultaneous charging of multiple devices at high speed using Anker’s exclusive PowerIQ and VoltageBoost technologies. Despite its large capacity, the PowerCore 26800 recharges in just 6 hours with a dual-input micro USB setup. Built with safety features like surge protection, temperature control, and short-circuit prevention, it ensures safe charging for all devices. Its durable build makes it perfect for travel, outdoor adventures, or emergency backup power. Compact enough to fit in a bag yet powerful enough to last days, this power bank is a must-have gadget for anyone who relies heavily on electronic devices.",
    "price": 8000,
    "discountPrice": 6999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Gadgets",
    "brand": "Anker",
    "rating": 4.7,
    "stock": 50,
    "featured": false,
    "colors": ["Black"],
    "images": ["https://m.media-amazon.com/images/I/81bGu0UEVdL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81xgZHyS7xL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81EzfUWUv2L._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Tanvir Alam", "rating": 5, "comment": "Charges my phone multiple times without issue."},
      {"user": "Sakib Hasan", "rating": 4, "comment": "A bit heavy but worth it for the power."},
      {"user": "Rony Mia", "rating": 5, "comment": "Very reliable for travel. Great build quality."},
      {"user": "Maruf Khan", "rating": 5, "comment": "The best power bank I’ve ever used."}
    ],
    "tags": ["powerbank", "charger", "gadgets", "Anker", "portable"],
    "createdAt": "2025-09-11T15:30:00Z",
    "updatedAt": "2025-09-11T15:30:00Z"
  },
  {
    "title": "Oculus Quest 3 VR Headset",
    "description": "The Oculus Quest 3 is Meta’s next-generation standalone VR headset, designed for gamers, creators, and tech enthusiasts who want immersive experiences without a PC or console. Featuring higher-resolution displays and improved refresh rates, it delivers sharper visuals and smoother gameplay. With upgraded optics, wider field of view, and improved hand tracking, interactions feel more natural and responsive. The Quest 3 is powered by a high-performance Snapdragon XR2 Gen 2 processor and supports a vast library of VR games and apps from the Meta Store. Lightweight and ergonomically designed, it ensures comfort during long play sessions. Built-in speakers with 3D positional audio enhance immersion, while optional accessories allow for expanded functionality. With wireless freedom, inside-out tracking, and next-gen mixed reality features, the Oculus Quest 3 represents the future of VR entertainment and productivity.",
    "price": 85000,
    "discountPrice": 79999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Gadgets",
    "brand": "Meta",
    "rating": 4.8,
    "stock": 12,
    "featured": true,
    "colors": ["White", "Black"],
    "images": ["https://m.media-amazon.com/images/I/51OT7thu1CL._SX425_.jpg", "https://m.media-amazon.com/images/I/51aG1iWX0VL._SX522_.jpg", "https://m.media-amazon.com/images/I/51uLNN6vZ8L._SX522_.jpg"],
    "reviews": [
      {"user": "Zahid Hasan", "rating": 5, "comment": "Best VR experience so far. Truly immersive."},
      {"user": "Munni Akter", "rating": 5, "comment": "Comfortable to wear and visuals are stunning."},
      {"user": "Nabil Rahman", "rating": 4, "comment": "Pricey but feels next-gen. Great investment."},
      {"user": "Shamim Chowdhury", "rating": 5, "comment": "Hand tracking is impressive and fun to use."}
    ],
    "tags": ["oculus", "VR", "gadgets", "gaming", "meta"],
    "createdAt": "2025-09-11T15:35:00Z",
    "updatedAt": "2025-09-11T15:35:00Z"
  },

  
  {
    "title": "Anker PowerCore 20,000mAh Power Bank",
    "description": "The Anker PowerCore 20,000mAh Power Bank is designed to keep your devices charged throughout the day, whether you're at work, traveling, or simply out and about. Equipped with Anker’s advanced PowerIQ and VoltageBoost technologies, it ensures optimized charging for smartphones, tablets, and other USB-powered devices. The massive 20,000mAh capacity provides up to five full charges for most phones and at least two charges for tablets, making it a dependable companion on long trips. Despite its high capacity, the design remains sleek and portable, fitting easily into backpacks or handbags. Safety features like surge protection, temperature control, and short-circuit prevention guarantee peace of mind while charging multiple devices simultaneously. Its dual USB outputs allow you to charge two devices at once, perfect for sharing with family or friends. Built with durable materials, the PowerCore is resistant to scratches and wear, making it ideal for everyday use. Whether you’re commuting, camping, or attending long events, this power bank ensures that you never run out of battery. With its trusted Anker quality, this accessory is a must-have for anyone seeking reliable and fast charging on the go.",
    "price": 3500,
    "discountPrice": 2999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Accessories",
    "brand": "Anker",
    "rating": 4.8,
    "stock": 20,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/51QnQFg7wmL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61snPpRPT+L._AC_SY679_.jpg", "https://m.media-amazon.com/images/I/71n7FJw6MuL._AC_SY679_.jpg"],
    "reviews": [
      {"user": "Rafi Hossain", "rating": 5, "comment": "Charges my phone multiple times. Excellent backup for traveling."},
      {"user": "Tanvir Alam", "rating": 4, "comment": "Slightly heavy but worth it for the huge capacity."},
      {"user": "Samiul Kabir", "rating": 5, "comment": "Charges fast and safely. A must-have power bank."},
      {"user": "Hasibul Karim", "rating": 5, "comment": "Durable and reliable. I’ve been using it daily without issues."}
    ],
    "tags": ["power bank", "charger", "Anker", "portable battery"],
    "createdAt": "2025-09-11T14:20:00Z",
    "updatedAt": "2025-09-11T14:20:00Z"
  },
  {
    "title": "Logitech MX Master 3 Wireless Mouse",
    "description": "The Logitech MX Master 3 Wireless Mouse is a premium accessory designed for professionals and creators who demand precision, speed, and comfort. Engineered with Logitech’s MagSpeed Electromagnetic scrolling, this mouse offers ultra-fast scrolling through thousands of lines in seconds while also providing pixel-by-pixel precision. The ergonomic design ensures all-day comfort, reducing strain during extended use. With customizable buttons and gesture controls, it adapts to your workflow, whether you’re designing, coding, or managing spreadsheets. The MX Master 3 connects via Bluetooth or the included USB receiver, ensuring stable performance across multiple devices. A standout feature is its ability to control up to three devices simultaneously and seamlessly switch between them, boosting productivity. The built-in rechargeable battery lasts up to 70 days on a single charge, and a quick one-minute charge provides three hours of use, making it highly efficient. Compatible with Windows, macOS, and Linux, it also integrates smoothly with popular creative software like Adobe Photoshop and Premiere Pro. Sleek, durable, and highly responsive, the MX Master 3 is the go-to choice for anyone who values productivity and comfort in their daily digital tasks.",
    "price": 12000,
    "discountPrice": 10499,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Accessories",
    "brand": "Logitech",
    "rating": 4.9,
    "stock": 12,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/71cN9D3XuqL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/81uWQoDbD0L._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71riLGAhqEL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Riyad Mahmud", "rating": 5, "comment": "Best mouse I’ve ever used. Worth every penny."},
      {"user": "Nusrat Jahan", "rating": 5, "comment": "Scrolling feature is amazing. Perfect for editing and office work."},
      {"user": "Zahid Hasan", "rating": 5, "comment": "Battery life is insane. Charges so quickly."},
      {"user": "Mehedi Islam", "rating": 4, "comment": "Slightly expensive but the performance justifies it."},
      {"user": "Shamim Khan", "rating": 5, "comment": "Super smooth. Love switching between my laptop and PC."}
    ],
    "tags": ["mouse", "wireless", "logitech", "ergonomic"],
    "createdAt": "2025-09-11T14:25:00Z",
    "updatedAt": "2025-09-11T14:25:00Z"
  },
  {
    "title": "Sony WH-1000XM5 Wireless Headphones",
    "description": "The Sony WH-1000XM5 Wireless Headphones set a new standard in noise-canceling technology and immersive audio. Designed for music lovers and professionals alike, they deliver crystal-clear sound with deep bass, detailed mids, and sparkling highs. Sony’s industry-leading noise cancellation adapts to your environment, blocking out distractions whether you’re on a plane, train, or in a busy office. The headphones feature a lightweight, ergonomic design with soft earcups that provide all-day comfort. With up to 30 hours of battery life, they keep the music going, and a quick 10-minute charge provides up to 5 hours of playback. Built-in touch controls on the earcups allow you to manage playback, adjust volume, and take calls seamlessly. The integrated microphone system ensures clear, crisp voice calls, making it perfect for both entertainment and work. Additionally, the WH-1000XM5 supports multipoint connectivity, allowing you to switch between devices effortlessly. They fold flat for easy storage in the included carrying case, making them ideal for travel. Whether you’re working remotely, commuting, or simply enjoying music, these headphones provide an unparalleled audio experience.",
    "price": 28000,
    "discountPrice": 25999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Accessories",
    "brand": "Sony",
    "rating": 4.9,
    "stock": 8,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/519JPzTAdVL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/51Pv3J+TtcL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/51Jfue6LzIL._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Alif Rahman", "rating": 5, "comment": "Noise cancellation is unmatched. Best headphones I’ve owned."},
      {"user": "Shuvo Das", "rating": 5, "comment": "Super comfortable for long listening sessions."},
      {"user": "Munira Akter", "rating": 4, "comment": "Sound quality is amazing but slightly bulky."},
      {"user": "Imran Hossain", "rating": 5, "comment": "Battery life is impressive. Perfect for travel."}
    ],
    "tags": ["headphones", "wireless", "noise cancelling", "sony"],
    "createdAt": "2025-09-11T14:30:00Z",
    "updatedAt": "2025-09-11T14:30:00Z"
  },
  {
    "title": "Samsung T7 Portable SSD 1TB",
    "description": "The Samsung T7 Portable SSD 1TB combines speed, security, and sleek design in a compact package. Featuring USB 3.2 Gen 2 technology, it delivers blazing-fast transfer speeds of up to 1,050 MB/s, making it ideal for transferring large files like videos, photos, and games. The slim, pocket-sized design ensures portability, while the solid aluminum body provides durability and shock resistance, protecting your data during travel. Equipped with AES 256-bit hardware encryption and password protection, the T7 ensures your files remain secure. It is compatible with a wide range of devices including PCs, Macs, Android smartphones, and gaming consoles, offering versatility across platforms. The LED status indicator keeps you informed about activity, and the included USB Type-C to C and Type-C to A cables provide convenience for different devices. With no moving parts, it operates silently and remains cool during use. Whether you’re a professional handling large media files or a student storing assignments and projects, the Samsung T7 is an excellent choice for reliable and fast data storage.",
    "price": 13500,
    "discountPrice": 11999,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Accessories",
    "brand": "Samsung",
    "rating": 4.8,
    "stock": 14,
    "featured": false,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/91YfRIy7kYL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/71GLePl1sXL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/61E+i9xx0XL._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Tariq Hossain", "rating": 5, "comment": "Super fast transfers. Perfect for video editing projects."},
      {"user": "Farzana Rahim", "rating": 5, "comment": "Small, sleek, and durable. Great storage solution."},
      {"user": "Nayeem Islam", "rating": 4, "comment": "A bit pricey, but performance is worth it."},
      {"user": "Sadia Ahmed", "rating": 5, "comment": "Very reliable SSD. No heating issues even after long use."}
    ],
    "tags": ["ssd", "storage", "portable", "samsung"],
    "createdAt": "2025-09-11T14:35:00Z",
    "updatedAt": "2025-09-11T14:35:00Z"
  },
  {
    "title": "Apple AirPods Pro (2nd Generation)",
    "description": "Apple AirPods Pro (2nd Generation) offer a premium audio experience with enhanced active noise cancellation and adaptive transparency mode. Featuring Apple’s H2 chip, they deliver superior sound quality with deep bass and crisp highs. The earbuds provide a customizable fit with three sizes of silicone tips, ensuring comfort for all-day use. Adaptive EQ automatically tunes music to your ears, delivering a personalized experience. The new charging case includes Precision Finding with Find My support, making it easier to locate if misplaced. With up to 6 hours of listening time on a single charge and more than 30 hours with the case, AirPods Pro are perfect for commuting, workouts, or long study sessions. The case supports wireless charging with MagSafe, adding convenience. The built-in microphones and beamforming technology ensure clear calls even in noisy environments. Sweat and water resistance make them suitable for workouts and outdoor activities. Compact, powerful, and easy to use, AirPods Pro are designed to work seamlessly with all Apple devices, elevating your listening experience to the next level.",
    "price": 28500,
    "discountPrice": 26500,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Accessories",
    "brand": "Apple",
    "rating": 4.9,
    "stock": 10,
    "featured": true,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/61lqyEJeHXL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71yUMVPqOzL._AC_SX679_.jpg", "https://m.media-amazon.com/images/I/71uwnZuhKBL._AC_SX679_.jpg"],
    "reviews": [
      {"user": "Shahriar Rahman", "rating": 5, "comment": "Best noise cancelling earbuds in the market."},
      {"user": "Jannat Akter", "rating": 5, "comment": "Super comfortable. Battery lasts longer than expected."},
      {"user": "Khalid Hasan", "rating": 4, "comment": "Great sound but works best with Apple devices only."},
      {"user": "Tahmid Chowdhury", "rating": 5, "comment": "Transparency mode is really impressive."}
    ],
    "tags": ["earbuds", "wireless", "apple", "airpods"],
    "createdAt": "2025-09-11T14:40:00Z",
    "updatedAt": "2025-09-11T14:40:00Z"
  },
  {
    "title": "Baseus GaN 65W Fast Charger",
    "description": "The Baseus GaN 65W Fast Charger is a compact and powerful accessory that revolutionizes charging for modern devices. Built with GaN (Gallium Nitride) technology, it delivers high-speed charging in a smaller and more efficient design. The 65W output is capable of charging laptops, tablets, and smartphones simultaneously through its multiple ports, including USB-C and USB-A. Intelligent power distribution ensures each device gets the optimal charge, preventing overheating and overcharging. Its foldable plug and lightweight body make it an ideal travel companion, fitting easily into pockets or bags. Compatible with major devices like MacBook, Dell XPS, iPhone, Samsung, and more, this charger reduces the need to carry multiple adapters. Built-in safety features provide peace of mind, and the durable construction ensures longevity. Whether you’re at home, in the office, or traveling abroad, the Baseus GaN Charger is a versatile solution to keep all your gadgets powered efficiently. Fast, reliable, and future-proof, it’s a must-have accessory for anyone juggling multiple devices.",
    "price": 4200,
    "discountPrice": 3699,
    "currency": "BDT",
    "category": "Electronics",
    "subCategory": "Accessories",
    "brand": "Baseus",
    "rating": 4.7,
    "stock": 22,
    "featured": false,
    "sizes": ["One Size"],
    "images": ["https://m.media-amazon.com/images/I/61IQ9lkOKxL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/71LJXcQxuXL._AC_SX466_.jpg", "https://m.media-amazon.com/images/I/71-aC-QshgL._AC_SX466_.jpg"],
    "reviews": [
      {"user": "Asif Rahman", "rating": 5, "comment": "Charges my MacBook and phone together. Very fast and reliable."},
      {"user": "Maruf Ahmed", "rating": 4, "comment": "Compact and powerful. Slightly warms up during use."},
      {"user": "Rifat Islam", "rating": 5, "comment": "Excellent travel charger. Fits perfectly in my bag."},
      {"user": "Sabrina Jahan", "rating": 5, "comment": "Handles multiple devices at once without slowing down."}
    ],
    "tags": ["charger", "fast charging", "gan", "usb-c"],
    "createdAt": "2025-09-11T14:45:00Z",
    "updatedAt": "2025-09-11T14:45:00Z"
  }









]